  ConsoleApplication1.cpp
  class _PMD	size(12):
  	+---
   0	| mdisp
   4	| pdisp
   8	| vdisp
  	+---
  class _TypeDescriptor	size(16):
  	+---
   0	| pVFTable
   8	| spare
  16	| name
  	+---
  class _s__CatchableType	size(36):
  	+---
   0	| properties
   4	| pType
  12	| _PMD thisDisplacement
  24	| sizeOrOffset
  28	| copyFunction
  	+---
  class _s__CatchableTypeArray	size(4):
  	+---
   0	| nCatchableTypes
   4	| arrayOfCatchableTypes
  	+---
  class _s__ThrowInfo	size(28):
  	+---
   0	| attributes
   4	| pmfnUnwind
  12	| pForwardCompat
  20	| pCatchableTypeArray
  	+---
  class _s__RTTIBaseClassDescriptor	size(36):
  	+---
   0	| pTypeDescriptor
   8	| numContainedBases
  12	| _PMD where
  24	| attributes
  28	| pClassDescriptor
  	+---
  class _s__RTTIBaseClassArray	size(4):
  	+---
   0	| arrayOfBaseClassDescriptors
    	| <alignment member> (size=3)
  	+---
  class _s__RTTIClassHierarchyDescriptor	size(20):
  	+---
   0	| signature
   4	| attributes
   8	| numBaseClasses
  12	| pBaseClassArray
  	+---
  class _s__RTTICompleteObjectLocator2	size(36):
  	+---
   0	| signature
   4	| offset
   8	| cdOffset
  12	| pTypeDescriptor
  20	| pClassDescriptor
  28	| pSelf
  	+---
  class __s_GUID	size(16):
  	+---
   0	| Data1
   4	| Data2
   6	| Data3
   8	| Data4
  	+---
  class __noop_coroutine_frame_standard	size(24):
  	+---
   0	| resume
   8	| destroy
  16	| promise
    	| <alignment member> (size=7)
  	+---
  class __noop_coroutine_frame_legacy	size(16):
  	+---
   0	| resume
   8	| flag
  12	| index
  	+---
  class __crt_locale_data_public	size(16):
  	+---
   0	| _locale_pctype
   8	| _locale_mb_cur_max
  12	| _locale_lc_codepage
  	+---
  class __crt_locale_pointers	size(16):
  	+---
   0	| locinfo
   8	| mbcinfo
  	+---
  class _Mbstatet	size(8):
  	+---
   0	| _Wchar
   4	| _Byte
   6	| _State
  	+---
  class std::nothrow_t	size(1):
  	+---
  	+---
  class _CrtMemState	size(104):
  	+---
   0	| pBlockHeader
   8	| lCounts
  48	| lSizes
  88	| lHighWaterCount
  96	| lTotalCount
  	+---
  class std::_Lockit	size(4):
  	+---
   0	| _Locktype
  	+---
  class _exception	size(40):
  	+---
   0	| type
    	| <alignment member> (size=4)
   8	| name
  16	| arg1
  24	| arg2
  32	| retval
  	+---
  class _complex	size(16):
  	+---
   0	| x
   8	| y
  	+---
  class <unnamed-tag>	size(8):
  	+---
   0	| _Sh
   0	| _Val
  	+---
  class <unnamed-tag>	size(4):
  	+---
   0	| _Sh
   0	| _Val
  	+---
  class <unnamed-tag>	size(8):
  	+---
   0	| _Sh
   0	| _Val
  	+---
  class <unnamed-tag>	size(8):
  	+---
   0	| _Word
   0	| _Float
   0	| _Double
   0	| _Long_double
  	+---
  class _Combined_type<float,double>	size(1):
  	+---
  	+---
  class _Combined_type<float,long double>	size(1):
  	+---
  	+---
  class _Real_widened<float,float>	size(1):
  	+---
  	+---
  class _Real_widened<float,double>	size(1):
  	+---
  	+---
  class _Real_widened<double,float>	size(1):
  	+---
  	+---
  class _Real_widened<double,double>	size(1):
  	+---
  	+---
  class _Real_type<float>	size(1):
  	+---
  	+---
  class _Real_type<long double>	size(1):
  	+---
  	+---
  class _div_t	size(8):
  	+---
   0	| quot
   4	| rem
  	+---
  class _ldiv_t	size(8):
  	+---
   0	| quot
   4	| rem
  	+---
  class _lldiv_t	size(16):
  	+---
   0	| quot
   8	| rem
  	+---
  class <unnamed-tag>	size(10):
  	+---
   0	| ld
  	+---
  class <unnamed-tag>	size(8):
  	+---
   0	| x
  	+---
  class <unnamed-tag>	size(4):
  	+---
   0	| f
  	+---
  class <unnamed-tag>	size(8):
  	+---
   0	| x
  	+---
  class <unnamed-tag>	size(12):
  	+---
   0	| ld12
  	+---
  class std::integral_constant<bool,0>	size(1):
  	+---
  	+---
  class _iobuf	size(8):
  	+---
   0	| _Placeholder
  	+---
  class __vcrt_va_list_is_reference<struct __crt_locale_pointers * const>	size(1):
  	+---
  	+---
  class __vcrt_assert_va_start_is_not_reference<struct __crt_locale_pointers * const>	size(1):
  	+---
  	+---
  class __vcrt_va_list_is_reference<wchar_t const * const>	size(1):
  	+---
  	+---
  class __vcrt_assert_va_start_is_not_reference<wchar_t const * const>	size(1):
  	+---
  	+---
  class __vcrt_va_list_is_reference<wchar_t const *>	size(1):
  	+---
  	+---
  class __vcrt_assert_va_start_is_not_reference<wchar_t const *>	size(1):
  	+---
  	+---
  class __vcrt_va_list_is_reference<struct __crt_locale_pointers *>	size(1):
  	+---
  	+---
  class __vcrt_assert_va_start_is_not_reference<struct __crt_locale_pointers *>	size(1):
  	+---
  	+---
  class __vcrt_va_list_is_reference<char const * const>	size(1):
  	+---
  	+---
  class __vcrt_assert_va_start_is_not_reference<char const * const>	size(1):
  	+---
  	+---
  class __vcrt_va_list_is_reference<char const *>	size(1):
  	+---
  	+---
  class __vcrt_assert_va_start_is_not_reference<char const *>	size(1):
  	+---
  	+---
  class _wfinddata32_t	size(540):
  	+---
   0	| attrib
   4	| time_create
   8	| time_access
  12	| time_write
  16	| size
  20	| name
  	+---
  class _wfinddata32i64_t	size(544):
  	+---
   0	| attrib
   4	| time_create
   8	| time_access
  12	| time_write
  16	| size
  24	| name
  	+---
  class _wfinddata64i32_t	size(560):
  	+---
   0	| attrib
    	| <alignment member> (size=4)
   8	| time_create
  16	| time_access
  24	| time_write
  32	| size
  36	| name
    	| <alignment member> (size=4)
  	+---
  class _wfinddata64_t	size(560):
  	+---
   0	| attrib
    	| <alignment member> (size=4)
   8	| time_create
  16	| time_access
  24	| time_write
  32	| size
  40	| name
  	+---
  class tm	size(36):
  	+---
   0	| tm_sec
   4	| tm_min
   8	| tm_hour
  12	| tm_mday
  16	| tm_mon
  20	| tm_year
  24	| tm_wday
  28	| tm_yday
  32	| tm_isdst
  	+---
  class _stat32	size(36):
  	+---
   0	| st_dev
   4	| st_ino
   6	| st_mode
   8	| st_nlink
  10	| st_uid
  12	| st_gid
    	| <alignment member> (size=2)
  16	| st_rdev
  20	| st_size
  24	| st_atime
  28	| st_mtime
  32	| st_ctime
  	+---
  class _stat32i64	size(48):
  	+---
   0	| st_dev
   4	| st_ino
   6	| st_mode
   8	| st_nlink
  10	| st_uid
  12	| st_gid
    	| <alignment member> (size=2)
  16	| st_rdev
    	| <alignment member> (size=4)
  24	| st_size
  32	| st_atime
  36	| st_mtime
  40	| st_ctime
    	| <alignment member> (size=4)
  	+---
  class _stat64i32	size(48):
  	+---
   0	| st_dev
   4	| st_ino
   6	| st_mode
   8	| st_nlink
  10	| st_uid
  12	| st_gid
    	| <alignment member> (size=2)
  16	| st_rdev
  20	| st_size
  24	| st_atime
  32	| st_mtime
  40	| st_ctime
  	+---
  class _stat64	size(56):
  	+---
   0	| st_dev
   4	| st_ino
   6	| st_mode
   8	| st_nlink
  10	| st_uid
  12	| st_gid
    	| <alignment member> (size=2)
  16	| st_rdev
    	| <alignment member> (size=4)
  24	| st_size
  32	| st_atime
  40	| st_mtime
  48	| st_ctime
  	+---
  class stat	size(48):
  	+---
   0	| st_dev
   4	| st_ino
   6	| st_mode
   8	| st_nlink
  10	| st_uid
  12	| st_gid
    	| <alignment member> (size=2)
  16	| st_rdev
  20	| st_size
  24	| st_atime
  32	| st_mtime
  40	| st_ctime
  	+---
  class std::plus<void>	size(1):
  	+---
  	+---
  class std::minus<void>	size(1):
  	+---
  	+---
  class std::multiplies<void>	size(1):
  	+---
  	+---
  class std::equal_to<void>	size(1):
  	+---
  	+---
  class std::not_equal_to<void>	size(1):
  	+---
  	+---
  class std::greater<void>	size(1):
  	+---
  	+---
  class std::less<void>	size(1):
  	+---
  	+---
  class std::greater_equal<void>	size(1):
  	+---
  	+---
  class std::less_equal<void>	size(1):
  	+---
  	+---
  class std::integral_constant<bool,1>	size(1):
  	+---
  	+---
  class std::_Select<0>	size(1):
  	+---
  	+---
  class std::_Make_signed2<1>	size(1):
  	+---
  	+---
  class std::_Make_signed2<2>	size(1):
  	+---
  	+---
  class std::_Make_signed2<4>	size(1):
  	+---
  	+---
  class std::_Make_signed2<8>	size(1):
  	+---
  	+---
  class std::_Make_unsigned2<1>	size(1):
  	+---
  	+---
  class std::_Make_unsigned2<2>	size(1):
  	+---
  	+---
  class std::_Make_unsigned2<4>	size(1):
  	+---
  	+---
  class std::_Make_unsigned2<8>	size(1):
  	+---
  	+---
  class std::integral_constant<unsigned __int64,0>	size(1):
  	+---
  	+---
  class std::_Maximum<>	size(1):
  	+---
   0	| +--- (base class std::integral_constant<unsigned __int64,0>)
  	| +---
  	+---
  class std::common_type<>	size(1):
  	+---
  	+---
  class std::_Invoker_functor	size(1):
  	+---
  	+---
  class std::_Invoker_pmf_object	size(1):
  	+---
  	+---
  class std::_Invoker_pmf_refwrap	size(1):
  	+---
  	+---
  class std::_Invoker_pmf_pointer	size(1):
  	+---
  	+---
  class std::_Invoker_pmd_object	size(1):
  	+---
  	+---
  class std::_Invoker_pmd_refwrap	size(1):
  	+---
  	+---
  class std::_Invoker_pmd_pointer	size(1):
  	+---
  	+---
  class std::hash<float>	size(1):
  	+---
  	+---
  class std::hash<double>	size(1):
  	+---
  	+---
  class std::hash<long double>	size(1):
  	+---
  	+---
  class std::hash<std::nullptr_t>	size(1):
  	+---
  	+---
  class std::_Floating_type_traits<float>	size(1):
  	+---
  	+---
  class std::_Floating_type_traits<double>	size(1):
  	+---
  	+---
  class std::_Floating_type_traits<long double>	size(1):
  	+---
   0	| +--- (base class std::_Floating_type_traits<double>)
  	| +---
  	+---
  class std::piecewise_construct_t	size(1):
  	+---
  	+---
  class std::allocator_arg_t	size(1):
  	+---
  	+---
  class std::integral_constant<unsigned __int64,2>	size(1):
  	+---
  	+---
  class std::input_iterator_tag	size(1):
  	+---
  	+---
  class std::output_iterator_tag	size(1):
  	+---
  	+---
  class std::forward_iterator_tag	size(1):
  	+---
   0	| +--- (base class std::input_iterator_tag)
  	| +---
  	+---
  class std::bidirectional_iterator_tag	size(1):
  	+---
   0	| +--- (base class std::forward_iterator_tag)
   0	| | +--- (base class std::input_iterator_tag)
  	| | +---
  	| +---
  	+---
  class std::random_access_iterator_tag	size(1):
  	+---
   0	| +--- (base class std::bidirectional_iterator_tag)
   0	| | +--- (base class std::forward_iterator_tag)
   0	| | | +--- (base class std::input_iterator_tag)
  	| | | +---
  	| | +---
  	| +---
  	+---
  class std::_Unused_parameter	size(1):
  	+---
  	+---
  class std::_Distance_unknown	size(1):
  	+---
  	+---
  class std::_Default_sentinel	size(1):
  	+---
  	+---
  class std::_False_trivial_cat	size(1):
  	+---
  	+---
  class std::_Is_character<char>	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,1>)
  	| +---
  	+---
  class std::_Is_character<signed char>	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,1>)
  	| +---
  	+---
  class std::_Is_character<unsigned char>	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,1>)
  	| +---
  	+---
  class std::_Is_character_or_bool<bool>	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,1>)
  	| +---
  	+---
  class std::istreambuf_iterator<`template-type-parameter-1',`template-type-parameter-2'>::_Istreambuf_proxy	size(4):
  	+---
   0	| _Strbuf
   0	| _Keep
  	+---
  class _heapinfo	size(24):
  	+---
   0	| _pentry
   8	| _size
  16	| _useflag
    	| <alignment member> (size=4)
  	+---
  class __std_exception_data	size(16):
  	+---
   0	| _What
   8	| _DoFree
    	| <alignment member> (size=7)
  	+---
  class std::exception	size(24):
  	+---
   0	| {vfptr}
   8	| __std_exception_data _Data
  	+---
  std::exception::$vftable@:
  	| &exception_meta
  	|  0
   0	| &std::exception::{dtor}
   1	| &std::exception::what
  std::exception::{dtor} this adjustor: 0
  std::exception::what this adjustor: 0
  std::exception::__delDtor this adjustor: 0
  std::exception::__vecDelDtor this adjustor: 0
  class std::bad_exception	size(24):
  	+---
   0	| +--- (base class std::exception)
   0	| | {vfptr}
   8	| | __std_exception_data _Data
  	| +---
  	+---
  std::bad_exception::$vftable@:
  	| &bad_exception_meta
  	|  0
   0	| &std::bad_exception::{dtor}
   1	| &std::exception::what
  std::bad_exception::{dtor} this adjustor: 0
  std::bad_exception::__delDtor this adjustor: 0
  std::bad_exception::__vecDelDtor this adjustor: 0
  class std::bad_alloc	size(24):
  	+---
   0	| +--- (base class std::exception)
   0	| | {vfptr}
   8	| | __std_exception_data _Data
  	| +---
  	+---
  std::bad_alloc::$vftable@:
  	| &bad_alloc_meta
  	|  0
   0	| &std::bad_alloc::{dtor}
   1	| &std::exception::what
  std::bad_alloc::{dtor} this adjustor: 0
  std::bad_alloc::__delDtor this adjustor: 0
  std::bad_alloc::__vecDelDtor this adjustor: 0
  class std::bad_array_new_length	size(24):
  	+---
   0	| +--- (base class std::bad_alloc)
   0	| | +--- (base class std::exception)
   0	| | | {vfptr}
   8	| | | __std_exception_data _Data
  	| | +---
  	| +---
  	+---
  std::bad_array_new_length::$vftable@:
  	| &bad_array_new_length_meta
  	|  0
   0	| &std::bad_array_new_length::{dtor}
   1	| &std::exception::what
  std::bad_array_new_length::{dtor} this adjustor: 0
  std::bad_array_new_length::__delDtor this adjustor: 0
  std::bad_array_new_length::__vecDelDtor this adjustor: 0
  class std::exception_ptr	size(16):
  	+---
   0	| _Data1
   8	| _Data2
  	+---
  class std::nested_exception	size(24):
  	+---
   0	| {vfptr}
   8	| exception_ptr _Exc
  	+---
  std::nested_exception::$vftable@:
  	| &nested_exception_meta
  	|  0
   0	| &std::nested_exception::{dtor}
  std::nested_exception::{dtor} this adjustor: 0
  std::nested_exception::__delDtor this adjustor: 0
  std::nested_exception::__vecDelDtor this adjustor: 0
  class std::bad_variant_access	size(24):
  	+---
   0	| +--- (base class std::exception)
   0	| | {vfptr}
   8	| | __std_exception_data _Data
  	| +---
  	+---
  std::bad_variant_access::$vftable@:
  	| &bad_variant_access_meta
  	|  0
   0	| &std::bad_variant_access::{dtor}
   1	| &std::bad_variant_access::what
  std::bad_variant_access::what this adjustor: 0
  std::bad_variant_access::{dtor} this adjustor: 0
  std::bad_variant_access::__delDtor this adjustor: 0
  std::bad_variant_access::__vecDelDtor this adjustor: 0
  class std::_Num_base	size(1):
  	+---
  	+---
  class std::_Num_int_base	size(1):
  	+---
   0	| +--- (base class std::_Num_base)
  	| +---
  	+---
  class std::_Num_float_base	size(1):
  	+---
   0	| +--- (base class std::_Num_base)
  	| +---
  	+---
  class std::numeric_limits<bool>	size(1):
  	+---
   0	| +--- (base class std::_Num_int_base)
   0	| | +--- (base class std::_Num_base)
  	| | +---
  	| +---
  	+---
  class std::numeric_limits<char>	size(1):
  	+---
   0	| +--- (base class std::_Num_int_base)
   0	| | +--- (base class std::_Num_base)
  	| | +---
  	| +---
  	+---
  class std::numeric_limits<signed char>	size(1):
  	+---
   0	| +--- (base class std::_Num_int_base)
   0	| | +--- (base class std::_Num_base)
  	| | +---
  	| +---
  	+---
  class std::numeric_limits<unsigned char>	size(1):
  	+---
   0	| +--- (base class std::_Num_int_base)
   0	| | +--- (base class std::_Num_base)
  	| | +---
  	| +---
  	+---
  class std::numeric_limits<char16_t>	size(1):
  	+---
   0	| +--- (base class std::_Num_int_base)
   0	| | +--- (base class std::_Num_base)
  	| | +---
  	| +---
  	+---
  class std::numeric_limits<char32_t>	size(1):
  	+---
   0	| +--- (base class std::_Num_int_base)
   0	| | +--- (base class std::_Num_base)
  	| | +---
  	| +---
  	+---
  class std::numeric_limits<wchar_t>	size(1):
  	+---
   0	| +--- (base class std::_Num_int_base)
   0	| | +--- (base class std::_Num_base)
  	| | +---
  	| +---
  	+---
  class std::numeric_limits<short>	size(1):
  	+---
   0	| +--- (base class std::_Num_int_base)
   0	| | +--- (base class std::_Num_base)
  	| | +---
  	| +---
  	+---
  class std::numeric_limits<int>	size(1):
  	+---
   0	| +--- (base class std::_Num_int_base)
   0	| | +--- (base class std::_Num_base)
  	| | +---
  	| +---
  	+---
  class std::numeric_limits<long>	size(1):
  	+---
   0	| +--- (base class std::_Num_int_base)
   0	| | +--- (base class std::_Num_base)
  	| | +---
  	| +---
  	+---
  class std::numeric_limits<__int64>	size(1):
  	+---
   0	| +--- (base class std::_Num_int_base)
   0	| | +--- (base class std::_Num_base)
  	| | +---
  	| +---
  	+---
  class std::numeric_limits<unsigned short>	size(1):
  	+---
   0	| +--- (base class std::_Num_int_base)
   0	| | +--- (base class std::_Num_base)
  	| | +---
  	| +---
  	+---
  class std::numeric_limits<unsigned int>	size(1):
  	+---
   0	| +--- (base class std::_Num_int_base)
   0	| | +--- (base class std::_Num_base)
  	| | +---
  	| +---
  	+---
  class std::numeric_limits<unsigned long>	size(1):
  	+---
   0	| +--- (base class std::_Num_int_base)
   0	| | +--- (base class std::_Num_base)
  	| | +---
  	| +---
  	+---
  class std::numeric_limits<unsigned __int64>	size(1):
  	+---
   0	| +--- (base class std::_Num_int_base)
   0	| | +--- (base class std::_Num_base)
  	| | +---
  	| +---
  	+---
  class std::numeric_limits<float>	size(1):
  	+---
   0	| +--- (base class std::_Num_float_base)
   0	| | +--- (base class std::_Num_base)
  	| | +---
  	| +---
  	+---
  class std::numeric_limits<double>	size(1):
  	+---
   0	| +--- (base class std::_Num_float_base)
   0	| | +--- (base class std::_Num_base)
  	| | +---
  	| +---
  	+---
  class std::numeric_limits<long double>	size(1):
  	+---
   0	| +--- (base class std::_Num_float_base)
   0	| | +--- (base class std::_Num_base)
  	| | +---
  	| +---
  	+---
  class std::_Default_allocate_traits	size(1):
  	+---
  	+---
  class std::allocator<void>	size(1):
  	+---
  	+---
  class std::_Fake_allocator	size(1):
  	+---
  	+---
  class std::_Container_base0	size(1):
  	+---
  	+---
  class std::_Iterator_base0	size(1):
  	+---
  	+---
  class std::_Container_proxy	size(16):
  	+---
   0	| _Mycont
   8	| _Myfirstiter
  	+---
  class std::_Container_base12	size(8):
  	+---
   0	| _Myproxy
  	+---
  class std::_Iterator_base12	size(16):
  	+---
   0	| _Myproxy
   8	| _Mynextiter
  	+---
  class std::is_nothrow_assignable<struct std::_Iterator_base12 * &,std::nullptr_t>	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,1>)
  	| +---
  	+---
  class std::_Leave_proxy_unbound	size(1):
  	+---
  	+---
  class std::_Fake_proxy_ptr_impl	size(1):
  	+---
  	+---
  class std::_Basic_container_proxy_ptr12	size(8):
  	+---
   0	| _Ptr
  	+---
  class std::_Zero_then_variadic_args_t	size(1):
  	+---
  	+---
  class std::_One_then_variadic_args_t	size(1):
  	+---
  	+---
  class std::_Move_allocator_tag	size(1):
  	+---
  	+---
  class std::_Alloc_temporary2<`template-type-parameter-1'>::<unnamed-tag>	size(4):
  	+---
   0	| _Value
  	+---
  class std::_Char_traits<char16_t,unsigned short>	size(1):
  	+---
  	+---
  class std::_WChar_traits<char16_t>	size(1):
  	+---
   0	| +--- (base class std::_Char_traits<char16_t,unsigned short>)
  	| +---
  	+---
  class std::char_traits<char16_t>	size(1):
  	+---
   0	| +--- (base class std::_WChar_traits<char16_t>)
   0	| | +--- (base class std::_Char_traits<char16_t,unsigned short>)
  	| | +---
  	| +---
  	+---
  class std::_Char_traits<char32_t,unsigned int>	size(1):
  	+---
  	+---
  class std::char_traits<char32_t>	size(1):
  	+---
   0	| +--- (base class std::_Char_traits<char32_t,unsigned int>)
  	| +---
  	+---
  class std::_Char_traits<wchar_t,unsigned short>	size(1):
  	+---
  	+---
  class std::_WChar_traits<wchar_t>	size(1):
  	+---
   0	| +--- (base class std::_Char_traits<wchar_t,unsigned short>)
  	| +---
  	+---
  class std::char_traits<wchar_t>	size(1):
  	+---
   0	| +--- (base class std::_WChar_traits<wchar_t>)
   0	| | +--- (base class std::_Char_traits<wchar_t,unsigned short>)
  	| | +---
  	| +---
  	+---
  class std::_Char_traits<char,int>	size(1):
  	+---
  	+---
  class std::_Narrow_char_traits<char,int>	size(1):
  	+---
   0	| +--- (base class std::_Char_traits<char,int>)
  	| +---
  	+---
  class std::char_traits<char>	size(1):
  	+---
   0	| +--- (base class std::_Narrow_char_traits<char,int>)
   0	| | +--- (base class std::_Char_traits<char,int>)
  	| | +---
  	| +---
  	+---
  class std::_String_val<`template-type-parameter-1'>::_Bxty	size(4):
  	+---
   0	| _Buf
   0	| _Ptr
   0	| _Alias
  	+---
  class std::_String_constructor_concat_tag	size(1):
  	+---
  	+---
  class std::_String_constructor_rvalue_allocator_tag	size(1):
  	+---
  	+---
  class std::allocator<char>	size(1):
  	+---
  	+---
  class std::_Default_allocator_traits<class std::allocator<char> >	size(1):
  	+---
  	+---
  class std::allocator_traits<class std::allocator<char> >	size(1):
  	+---
   0	| +--- (base class std::_Default_allocator_traits<class std::allocator<char> >)
  	| +---
  	+---
  class std::_Simple_types<char>	size(1):
  	+---
  	+---
  class std::_String_val<struct std::_Simple_types<char> >::_Bxty	size(16):
  	+---
   0	| _Buf
   0	| _Ptr
   0	| _Alias
  	+---
  class std::_String_val<struct std::_Simple_types<char> >	size(40):
  	+---
   0	| +--- (base class std::_Container_base12)
   0	| | _Myproxy
  	| +---
   8	| _Bxty _Bx
  24	| _Mysize
  32	| _Myres
  	+---
  class std::_Compressed_pair<class std::allocator<char>,class std::_String_val<struct std::_Simple_types<char> >,1>	size(40):
  	+---
   0	| +--- (base class std::allocator<char>)
  	| +---
   0	| ?$_String_val@U?$_Simple_types@D@std@@ _Myval2
  	+---
  class std::basic_string<char,struct std::char_traits<char>,class std::allocator<char> >	size(40):
  	+---
   0	| ?$_Compressed_pair@V?$allocator@D@std@@V?$_String_val@U?$_Simple_types@D@std@@@2@$00 _Mypair
  	+---
  class std::initializer_list<char>	size(16):
  	+---
   0	| _First
   8	| _Last
  	+---
  class std::allocator<wchar_t>	size(1):
  	+---
  	+---
  class std::_Default_allocator_traits<class std::allocator<wchar_t> >	size(1):
  	+---
  	+---
  class std::allocator_traits<class std::allocator<wchar_t> >	size(1):
  	+---
   0	| +--- (base class std::_Default_allocator_traits<class std::allocator<wchar_t> >)
  	| +---
  	+---
  class std::_Simple_types<wchar_t>	size(1):
  	+---
  	+---
  class std::_String_val<struct std::_Simple_types<wchar_t> >::_Bxty	size(16):
  	+---
   0	| _Buf
   0	| _Ptr
   0	| _Alias
  	+---
  class std::_String_val<struct std::_Simple_types<wchar_t> >	size(40):
  	+---
   0	| +--- (base class std::_Container_base12)
   0	| | _Myproxy
  	| +---
   8	| _Bxty _Bx
  24	| _Mysize
  32	| _Myres
  	+---
  class std::_Compressed_pair<class std::allocator<wchar_t>,class std::_String_val<struct std::_Simple_types<wchar_t> >,1>	size(40):
  	+---
   0	| +--- (base class std::allocator<wchar_t>)
  	| +---
   0	| ?$_String_val@U?$_Simple_types@_W@std@@ _Myval2
  	+---
  class std::basic_string<wchar_t,struct std::char_traits<wchar_t>,class std::allocator<wchar_t> >	size(40):
  	+---
   0	| ?$_Compressed_pair@V?$allocator@_W@std@@V?$_String_val@U?$_Simple_types@_W@std@@@2@$00 _Mypair
  	+---
  class std::initializer_list<wchar_t>	size(16):
  	+---
   0	| _First
   8	| _Last
  	+---
  class std::allocator<char16_t>	size(1):
  	+---
  	+---
  class std::_Default_allocator_traits<class std::allocator<char16_t> >	size(1):
  	+---
  	+---
  class std::allocator_traits<class std::allocator<char16_t> >	size(1):
  	+---
   0	| +--- (base class std::_Default_allocator_traits<class std::allocator<char16_t> >)
  	| +---
  	+---
  class std::_Simple_types<char16_t>	size(1):
  	+---
  	+---
  class std::_String_val<struct std::_Simple_types<char16_t> >::_Bxty	size(16):
  	+---
   0	| _Buf
   0	| _Ptr
   0	| _Alias
  	+---
  class std::_String_val<struct std::_Simple_types<char16_t> >	size(40):
  	+---
   0	| +--- (base class std::_Container_base12)
   0	| | _Myproxy
  	| +---
   8	| _Bxty _Bx
  24	| _Mysize
  32	| _Myres
  	+---
  class std::_Compressed_pair<class std::allocator<char16_t>,class std::_String_val<struct std::_Simple_types<char16_t> >,1>	size(40):
  	+---
   0	| +--- (base class std::allocator<char16_t>)
  	| +---
   0	| ?$_String_val@U?$_Simple_types@_S@std@@ _Myval2
  	+---
  class std::basic_string<char16_t,struct std::char_traits<char16_t>,class std::allocator<char16_t> >	size(40):
  	+---
   0	| ?$_Compressed_pair@V?$allocator@_S@std@@V?$_String_val@U?$_Simple_types@_S@std@@@2@$00 _Mypair
  	+---
  class std::initializer_list<char16_t>	size(16):
  	+---
   0	| _First
   8	| _Last
  	+---
  class std::allocator<char32_t>	size(1):
  	+---
  	+---
  class std::_Default_allocator_traits<class std::allocator<char32_t> >	size(1):
  	+---
  	+---
  class std::allocator_traits<class std::allocator<char32_t> >	size(1):
  	+---
   0	| +--- (base class std::_Default_allocator_traits<class std::allocator<char32_t> >)
  	| +---
  	+---
  class std::_Simple_types<char32_t>	size(1):
  	+---
  	+---
  class std::_String_val<struct std::_Simple_types<char32_t> >::_Bxty	size(16):
  	+---
   0	| _Buf
   0	| _Ptr
   0	| _Alias
  	+---
  class std::_String_val<struct std::_Simple_types<char32_t> >	size(40):
  	+---
   0	| +--- (base class std::_Container_base12)
   0	| | _Myproxy
  	| +---
   8	| _Bxty _Bx
  24	| _Mysize
  32	| _Myres
  	+---
  class std::_Compressed_pair<class std::allocator<char32_t>,class std::_String_val<struct std::_Simple_types<char32_t> >,1>	size(40):
  	+---
   0	| +--- (base class std::allocator<char32_t>)
  	| +---
   0	| ?$_String_val@U?$_Simple_types@_U@std@@ _Myval2
  	+---
  class std::basic_string<char32_t,struct std::char_traits<char32_t>,class std::allocator<char32_t> >	size(40):
  	+---
   0	| ?$_Compressed_pair@V?$allocator@_U@std@@V?$_String_val@U?$_Simple_types@_U@std@@@2@$00 _Mypair
  	+---
  class std::initializer_list<char32_t>	size(16):
  	+---
   0	| _First
   8	| _Last
  	+---
  class std::logic_error	size(24):
  	+---
   0	| +--- (base class std::exception)
   0	| | {vfptr}
   8	| | __std_exception_data _Data
  	| +---
  	+---
  std::logic_error::$vftable@:
  	| &logic_error_meta
  	|  0
   0	| &std::logic_error::{dtor}
   1	| &std::exception::what
  std::logic_error::{dtor} this adjustor: 0
  std::logic_error::__delDtor this adjustor: 0
  std::logic_error::__vecDelDtor this adjustor: 0
  class std::domain_error	size(24):
  	+---
   0	| +--- (base class std::logic_error)
   0	| | +--- (base class std::exception)
   0	| | | {vfptr}
   8	| | | __std_exception_data _Data
  	| | +---
  	| +---
  	+---
  std::domain_error::$vftable@:
  	| &domain_error_meta
  	|  0
   0	| &std::domain_error::{dtor}
   1	| &std::exception::what
  std::domain_error::{dtor} this adjustor: 0
  std::domain_error::__delDtor this adjustor: 0
  std::domain_error::__vecDelDtor this adjustor: 0
  class std::invalid_argument	size(24):
  	+---
   0	| +--- (base class std::logic_error)
   0	| | +--- (base class std::exception)
   0	| | | {vfptr}
   8	| | | __std_exception_data _Data
  	| | +---
  	| +---
  	+---
  std::invalid_argument::$vftable@:
  	| &invalid_argument_meta
  	|  0
   0	| &std::invalid_argument::{dtor}
   1	| &std::exception::what
  std::invalid_argument::{dtor} this adjustor: 0
  std::invalid_argument::__delDtor this adjustor: 0
  std::invalid_argument::__vecDelDtor this adjustor: 0
  class std::length_error	size(24):
  	+---
   0	| +--- (base class std::logic_error)
   0	| | +--- (base class std::exception)
   0	| | | {vfptr}
   8	| | | __std_exception_data _Data
  	| | +---
  	| +---
  	+---
  std::length_error::$vftable@:
  	| &length_error_meta
  	|  0
   0	| &std::length_error::{dtor}
   1	| &std::exception::what
  std::length_error::{dtor} this adjustor: 0
  std::length_error::__delDtor this adjustor: 0
  std::length_error::__vecDelDtor this adjustor: 0
  class std::out_of_range	size(24):
  	+---
   0	| +--- (base class std::logic_error)
   0	| | +--- (base class std::exception)
   0	| | | {vfptr}
   8	| | | __std_exception_data _Data
  	| | +---
  	| +---
  	+---
  std::out_of_range::$vftable@:
  	| &out_of_range_meta
  	|  0
   0	| &std::out_of_range::{dtor}
   1	| &std::exception::what
  std::out_of_range::{dtor} this adjustor: 0
  std::out_of_range::__delDtor this adjustor: 0
  std::out_of_range::__vecDelDtor this adjustor: 0
  class std::runtime_error	size(24):
  	+---
   0	| +--- (base class std::exception)
   0	| | {vfptr}
   8	| | __std_exception_data _Data
  	| +---
  	+---
  std::runtime_error::$vftable@:
  	| &runtime_error_meta
  	|  0
   0	| &std::runtime_error::{dtor}
   1	| &std::exception::what
  std::runtime_error::{dtor} this adjustor: 0
  std::runtime_error::__delDtor this adjustor: 0
  std::runtime_error::__vecDelDtor this adjustor: 0
  class std::overflow_error	size(24):
  	+---
   0	| +--- (base class std::runtime_error)
   0	| | +--- (base class std::exception)
   0	| | | {vfptr}
   8	| | | __std_exception_data _Data
  	| | +---
  	| +---
  	+---
  std::overflow_error::$vftable@:
  	| &overflow_error_meta
  	|  0
   0	| &std::overflow_error::{dtor}
   1	| &std::exception::what
  std::overflow_error::{dtor} this adjustor: 0
  std::overflow_error::__delDtor this adjustor: 0
  std::overflow_error::__vecDelDtor this adjustor: 0
  class std::underflow_error	size(24):
  	+---
   0	| +--- (base class std::runtime_error)
   0	| | +--- (base class std::exception)
   0	| | | {vfptr}
   8	| | | __std_exception_data _Data
  	| | +---
  	| +---
  	+---
  std::underflow_error::$vftable@:
  	| &underflow_error_meta
  	|  0
   0	| &std::underflow_error::{dtor}
   1	| &std::exception::what
  std::underflow_error::{dtor} this adjustor: 0
  std::underflow_error::__delDtor this adjustor: 0
  std::underflow_error::__vecDelDtor this adjustor: 0
  class std::range_error	size(24):
  	+---
   0	| +--- (base class std::runtime_error)
   0	| | +--- (base class std::exception)
   0	| | | {vfptr}
   8	| | | __std_exception_data _Data
  	| | +---
  	| +---
  	+---
  std::range_error::$vftable@:
  	| &range_error_meta
  	|  0
   0	| &std::range_error::{dtor}
   1	| &std::exception::what
  std::range_error::{dtor} this adjustor: 0
  std::range_error::__delDtor this adjustor: 0
  std::range_error::__vecDelDtor this adjustor: 0
  class std::once_flag	size(8):
  	+---
   0	| _Opaque
  	+---
  class _timespec32	size(8):
  	+---
   0	| tv_sec
   4	| tv_nsec
  	+---
  class _timespec64	size(16):
  	+---
   0	| tv_sec
   8	| tv_nsec
    	| <alignment member> (size=4)
  	+---
  class timespec	size(16):
  	+---
   0	| tv_sec
   8	| tv_nsec
    	| <alignment member> (size=4)
  	+---
  class xtime	size(16):
  	+---
   0	| sec
   8	| nsec
    	| <alignment member> (size=4)
  	+---
  class _Thrd_t	size(16):
  	+---
   0	| _Hnd
   8	| _Id
    	| <alignment member> (size=4)
  	+---
  class std::_Atomic_storage<class $RBAAB &,16>::_Int128	size(4):
  	+---
   0	| _Low
   0	| _High
  	+---
  class std::_Select<1>	size(1):
  	+---
  	+---
  class std::_Atomic_storage_types<long>	size(1):
  	+---
  	+---
  class std::_Atomic_padded<long>	size(4):
  	+---
   0	| _Value
  	+---
  class std::_Atomic_storage<long,4>	size(4):
  	+---
   0	| ?$_Atomic_padded@J _Storage
  	+---
  class std::_Atomic_integral<long,4>	size(4):
  	+---
   0	| +--- (base class std::_Atomic_storage<long,4>)
   0	| | ?$_Atomic_padded@J _Storage
  	| +---
  	+---
  class std::_Atomic_integral_facade<long>	size(4):
  	+---
   0	| +--- (base class std::_Atomic_integral<long,4>)
   0	| | +--- (base class std::_Atomic_storage<long,4>)
   0	| | | ?$_Atomic_padded@J _Storage
  	| | +---
  	| +---
  	+---
  class std::atomic<long>	size(4):
  	+---
   0	| +--- (base class std::_Atomic_integral_facade<long>)
   0	| | +--- (base class std::_Atomic_integral<long,4>)
   0	| | | +--- (base class std::_Atomic_storage<long,4>)
   0	| | | | ?$_Atomic_padded@J _Storage
  	| | | +---
  	| | +---
  	| +---
  	+---
  class std::atomic_flag	size(4):
  	+---
   0	| ?$atomic@J _Storage
  	+---
  class std::is_error_code_enum<enum std::io_errc>	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,1>)
  	| +---
  	+---
  class std::is_error_condition_enum<enum std::errc>	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,1>)
  	| +---
  	+---
  class std::error_category::_Addr_storage	size(8):
  	+---
   0	| _Num
   0	| _Ptr
  	+---
  class std::error_category	size(16):
  	+---
   0	| {vfptr}
   8	| _Addr_storage _Addr
  	+---
  std::error_category::$vftable@:
  	| &error_category_meta
  	|  0
   0	| &std::error_category::{dtor}
   1	| &std::error_category::name
   2	| &std::error_category::message
   3	| &std::error_category::default_error_condition
   4	| &std::error_category::equivalent
   5	| &std::error_category::equivalent
  std::error_category::{dtor} this adjustor: 0
  std::error_category::name this adjustor: 0
  std::error_category::message this adjustor: 0
  std::error_category::default_error_condition this adjustor: 0
  std::error_category::equivalent this adjustor: 0
  std::error_category::equivalent this adjustor: 0
  std::error_category::__delDtor this adjustor: 0
  std::error_category::__vecDelDtor this adjustor: 0
  class std::is_trivially_copyable<unsigned __int64>	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,1>)
  	| +---
  	+---
  class std::is_trivially_copyable<union std::error_category::_Addr_storage>	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,1>)
  	| +---
  	+---
  class std::error_code	size(16):
  	+---
   0	| _Myval
    	| <alignment member> (size=4)
   8	| _Mycat
  	+---
  class std::error_condition	size(16):
  	+---
   0	| _Myval
    	| <alignment member> (size=4)
   8	| _Mycat
  	+---
  class std::is_error_code_enum<class std::error_condition>	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,0>)
  	| +---
  	+---
  class std::is_error_code_enum<int>	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,0>)
  	| +---
  	+---
  class std::hash<class std::error_code>	size(1):
  	+---
  	+---
  class std::_Conditionally_enabled_hash<int,1>	size(1):
  	+---
  	+---
  class std::hash<int>	size(1):
  	+---
   0	| +--- (base class std::_Conditionally_enabled_hash<int,1>)
  	| +---
  	+---
  class std::hash<class std::error_condition>	size(1):
  	+---
  	+---
  class std::_System_error	size(40):
  	+---
   0	| +--- (base class std::runtime_error)
   0	| | +--- (base class std::exception)
   0	| | | {vfptr}
   8	| | | __std_exception_data _Data
  	| | +---
  	| +---
  24	| error_code _Mycode
  	+---
  std::_System_error::$vftable@:
  	| &_System_error_meta
  	|  0
   0	| &std::_System_error::{dtor}
   1	| &std::exception::what
  std::_System_error::{dtor} this adjustor: 0
  std::_System_error::__delDtor this adjustor: 0
  std::_System_error::__vecDelDtor this adjustor: 0
  class std::is_error_code_enum<class std::error_code>	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,0>)
  	| +---
  	+---
  class std::system_error	size(40):
  	+---
   0	| +--- (base class std::_System_error)
   0	| | +--- (base class std::runtime_error)
   0	| | | +--- (base class std::exception)
   0	| | | | {vfptr}
   8	| | | | __std_exception_data _Data
  	| | | +---
  	| | +---
  24	| | error_code _Mycode
  	| +---
  	+---
  std::system_error::$vftable@:
  	| &system_error_meta
  	|  0
   0	| &std::system_error::{dtor}
   1	| &std::exception::what
  std::system_error::{dtor} this adjustor: 0
  std::system_error::__delDtor this adjustor: 0
  std::system_error::__vecDelDtor this adjustor: 0
  class std::is_error_code_enum<class std::system_error>	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,0>)
  	| +---
  	+---
  class std::_System_error_message	size(16):
  	+---
   0	| _Str
   8	| _Length
  	+---
  class std::_Generic_error_category	size(16):
  	+---
   0	| +--- (base class std::error_category)
   0	| | {vfptr}
   8	| | _Addr_storage _Addr
  	| +---
  	+---
  std::_Generic_error_category::$vftable@:
  	| &_Generic_error_category_meta
  	|  0
   0	| &std::_Generic_error_category::{dtor}
   1	| &std::_Generic_error_category::name
   2	| &std::_Generic_error_category::message
   3	| &std::error_category::default_error_condition
   4	| &std::error_category::equivalent
   5	| &std::error_category::equivalent
  std::_Generic_error_category::name this adjustor: 0
  std::_Generic_error_category::message this adjustor: 0
  std::_Generic_error_category::{dtor} this adjustor: 0
  std::_Generic_error_category::__delDtor this adjustor: 0
  std::_Generic_error_category::__vecDelDtor this adjustor: 0
  class std::_Iostream_error_category2	size(16):
  	+---
   0	| +--- (base class std::error_category)
   0	| | {vfptr}
   8	| | _Addr_storage _Addr
  	| +---
  	+---
  std::_Iostream_error_category2::$vftable@:
  	| &_Iostream_error_category2_meta
  	|  0
   0	| &std::_Iostream_error_category2::{dtor}
   1	| &std::_Iostream_error_category2::name
   2	| &std::_Iostream_error_category2::message
   3	| &std::error_category::default_error_condition
   4	| &std::error_category::equivalent
   5	| &std::error_category::equivalent
  std::_Iostream_error_category2::name this adjustor: 0
  std::_Iostream_error_category2::message this adjustor: 0
  std::_Iostream_error_category2::{dtor} this adjustor: 0
  std::_Iostream_error_category2::__delDtor this adjustor: 0
  std::_Iostream_error_category2::__vecDelDtor this adjustor: 0
  class std::_System_error_category	size(16):
  	+---
   0	| +--- (base class std::error_category)
   0	| | {vfptr}
   8	| | _Addr_storage _Addr
  	| +---
  	+---
  std::_System_error_category::$vftable@:
  	| &_System_error_category_meta
  	|  0
   0	| &std::_System_error_category::{dtor}
   1	| &std::_System_error_category::name
   2	| &std::_System_error_category::message
   3	| &std::_System_error_category::default_error_condition
   4	| &std::error_category::equivalent
   5	| &std::error_category::equivalent
  std::_System_error_category::name this adjustor: 0
  std::_System_error_category::message this adjustor: 0
  std::_System_error_category::default_error_condition this adjustor: 0
  std::_System_error_category::{dtor} this adjustor: 0
  std::_System_error_category::__delDtor this adjustor: 0
  std::_System_error_category::__vecDelDtor this adjustor: 0
  class std::_Constexpr_immortalize_impl<`template-type-parameter-1'>::<unnamed-tag>	size(4):
  	+---
   0	| _Storage
  	+---
  class __std_type_info_data	size(16):
  	+---
   0	| _UndecoratedName
   8	| _DecoratedName
    	| <alignment member> (size=7)
  	+---
  class type_info	size(24):
  	+---
   0	| {vfptr}
   8	| __std_type_info_data _Data
  	+---
  type_info::$vftable@:
  	| &type_info_meta
  	|  0
   0	| &type_info::{dtor}
  type_info::{dtor} this adjustor: 0
  type_info::__delDtor this adjustor: 0
  type_info::__vecDelDtor this adjustor: 0
  class std::bad_cast	size(24):
  	+---
   0	| +--- (base class std::exception)
   0	| | {vfptr}
   8	| | __std_exception_data _Data
  	| +---
  	+---
  std::bad_cast::$vftable@:
  	| &bad_cast_meta
  	|  0
   0	| &std::bad_cast::{dtor}
   1	| &std::exception::what
  std::bad_cast::{dtor} this adjustor: 0
  std::bad_cast::__delDtor this adjustor: 0
  std::bad_cast::__vecDelDtor this adjustor: 0
  class std::bad_typeid	size(24):
  	+---
   0	| +--- (base class std::exception)
   0	| | {vfptr}
   8	| | __std_exception_data _Data
  	| +---
  	+---
  std::bad_typeid::$vftable@:
  	| &bad_typeid_meta
  	|  0
   0	| &std::bad_typeid::{dtor}
   1	| &std::exception::what
  std::bad_typeid::{dtor} this adjustor: 0
  std::bad_typeid::__delDtor this adjustor: 0
  std::bad_typeid::__vecDelDtor this adjustor: 0
  class std::__non_rtti_object	size(24):
  	+---
   0	| +--- (base class std::bad_typeid)
   0	| | +--- (base class std::exception)
   0	| | | {vfptr}
   8	| | | __std_exception_data _Data
  	| | +---
  	| +---
  	+---
  std::__non_rtti_object::$vftable@:
  	| &__non_rtti_object_meta
  	|  0
   0	| &std::__non_rtti_object::{dtor}
   1	| &std::exception::what
  std::__non_rtti_object::{dtor} this adjustor: 0
  std::__non_rtti_object::__delDtor this adjustor: 0
  std::__non_rtti_object::__vecDelDtor this adjustor: 0
  class std::auto_ptr<void>	size(1):
  	+---
  	+---
  class std::bad_weak_ptr	size(24):
  	+---
   0	| +--- (base class std::exception)
   0	| | {vfptr}
   8	| | __std_exception_data _Data
  	| +---
  	+---
  std::bad_weak_ptr::$vftable@:
  	| &bad_weak_ptr_meta
  	|  0
   0	| &std::bad_weak_ptr::{dtor}
   1	| &std::bad_weak_ptr::what
  std::bad_weak_ptr::what this adjustor: 0
  std::bad_weak_ptr::{dtor} this adjustor: 0
  std::bad_weak_ptr::__delDtor this adjustor: 0
  std::bad_weak_ptr::__vecDelDtor this adjustor: 0
  class std::_Ref_count_base	size(16):
  	+---
   0	| {vfptr}
   8	| _Uses
  12	| _Weaks
  	+---
  std::_Ref_count_base::$vftable@:
  	| &_Ref_count_base_meta
  	|  0
   0	| &std::_Ref_count_base::_Destroy
   1	| &std::_Ref_count_base::_Delete_this
   2	| &std::_Ref_count_base::{dtor}
   3	| &std::_Ref_count_base::_Get_deleter
  std::_Ref_count_base::_Destroy this adjustor: 0
  std::_Ref_count_base::_Delete_this this adjustor: 0
  std::_Ref_count_base::{dtor} this adjustor: 0
  std::_Ref_count_base::_Get_deleter this adjustor: 0
  std::_Ref_count_base::__delDtor this adjustor: 0
  std::_Ref_count_base::__vecDelDtor this adjustor: 0
  class std::_Ref_count_obj2<`template-type-parameter-1'>::<unnamed-tag>	size(4):
  	+---
   0	| ?$_Wrap@$RBAAB@ _Storage
  	+---
  class std::_Ref_count_obj_alloc3<`template-type-parameter-1',`template-type-parameter-2'>::<unnamed-tag>	size(4):
  	+---
   0	| ?$_Wrap@$RBAAB@ _Storage
  	+---
  class std::owner_less<void>	size(1):
  	+---
  	+---
  class std::_Shared_ptr_spin_lock	size(1):
  	+---
  	+---
  class std::_Facet_base	size(8):
  	+---
   0	| {vfptr}
  	+---
  std::_Facet_base::$vftable@:
  	| &_Facet_base_meta
  	|  0
   0	| &std::_Facet_base::{dtor}
   1	| &std::_Facet_base::_Incref
   2	| &std::_Facet_base::_Decref
  std::_Facet_base::{dtor} this adjustor: 0
  std::_Facet_base::_Incref this adjustor: 0
  std::_Facet_base::_Decref this adjustor: 0
  std::_Facet_base::__delDtor this adjustor: 0
  std::_Facet_base::__vecDelDtor this adjustor: 0
  class _Collvec	size(16):
  	+---
   0	| _Page
    	| <alignment member> (size=4)
   8	| _LocaleName
  	+---
  class _Ctypevec	size(32):
  	+---
   0	| _Page
    	| <alignment member> (size=4)
   8	| _Table
  16	| _Delfl
    	| <alignment member> (size=4)
  24	| _LocaleName
  	+---
  class _Cvtvec	size(44):
  	+---
   0	| _Page
   4	| _Mbcurmax
   8	| _Isclocale
  12	| _Isleadbyte
  	+---
  class lconv	size(152):
  	+---
   0	| decimal_point
   8	| thousands_sep
  16	| grouping
  24	| int_curr_symbol
  32	| currency_symbol
  40	| mon_decimal_point
  48	| mon_thousands_sep
  56	| mon_grouping
  64	| positive_sign
  72	| negative_sign
  80	| int_frac_digits
  81	| frac_digits
  82	| p_cs_precedes
  83	| p_sep_by_space
  84	| n_cs_precedes
  85	| n_sep_by_space
  86	| p_sign_posn
  87	| n_sign_posn
  88	| _W_decimal_point
  96	| _W_thousands_sep
  104	| _W_int_curr_symbol
  112	| _W_currency_symbol
  120	| _W_mon_decimal_point
  128	| _W_mon_thousands_sep
  136	| _W_positive_sign
  144	| _W_negative_sign
  	+---
  class std::_Timevec	size(8):
  	+---
   0	| _Timeptr
  	+---
  class std::_Yarn<char>	size(16):
  	+---
   0	| _Myptr
   8	| _Nul
    	| <alignment member> (size=7)
  	+---
  class std::_Yarn<wchar_t>	size(16):
  	+---
   0	| _Myptr
   8	| _Nul
    	| <alignment member> (size=6)
  	+---
  class std::_Locinfo	size(104):
  	+---
   0	| _Lockit _Lock
    	| <alignment member> (size=4)
   8	| ?$_Yarn@D _Days
  24	| ?$_Yarn@D _Months
  40	| ?$_Yarn@_W _W_Days
  56	| ?$_Yarn@_W _W_Months
  72	| ?$_Yarn@D _Oldlocname
  88	| ?$_Yarn@D _Newlocname
  	+---
  class std::_Crt_new_delete	size(1):
  	+---
  	+---
  class std::_Locbase<int>	size(1):
  	+---
  	+---
  class std::locale::id	size(8):
  	+---
   0	| _Id
  	+---
  class std::locale::facet	size(16):
  	+---
   0	| +--- (base class std::_Facet_base)
   0	| | {vfptr}
  	| +---
   8	| +--- (base class std::_Crt_new_delete)
  	| +---
   8	| _Myrefs
    	| <alignment member> (size=4)
  	+---
  std::locale::facet::$vftable@:
  	| &facet_meta
  	|  0
   0	| &std::locale::facet::{dtor}
   1	| &std::locale::facet::_Incref
   2	| &std::locale::facet::_Decref
  std::locale::facet::_Incref this adjustor: 0
  std::locale::facet::_Decref this adjustor: 0
  std::locale::facet::{dtor} this adjustor: 0
  std::locale::facet::__delDtor this adjustor: 0
  std::locale::facet::__vecDelDtor this adjustor: 0
  class std::locale::_Facet_guard	size(8):
  	+---
   0	| _Target
  	+---
  class std::locale::_Locimp	size(56):
  	+---
   0	| +--- (base class std::locale::facet)
   0	| | +--- (base class std::_Facet_base)
   0	| | | {vfptr}
  	| | +---
   8	| | +--- (base class std::_Crt_new_delete)
  	| | +---
   8	| | _Myrefs
    	| | <alignment member> (size=4)
  	| +---
  16	| _Facetvec
  24	| _Facetcount
  32	| _Catmask
  36	| _Xparent
    	| <alignment member> (size=3)
  40	| ?$_Yarn@D _Name
  	+---
  std::locale::_Locimp::$vftable@:
  	| &_Locimp_meta
  	|  0
   0	| &std::locale::_Locimp::{dtor}
   1	| &std::locale::facet::_Incref
   2	| &std::locale::facet::_Decref
  std::locale::_Locimp::{dtor} this adjustor: 0
  std::locale::_Locimp::__delDtor this adjustor: 0
  std::locale::_Locimp::__vecDelDtor this adjustor: 0
  class std::locale	size(16):
  	+---
   0	| +--- (base class std::_Locbase<int>)
  	| +---
   1	| +--- (base class std::_Crt_new_delete)
  	| +---
    	| <alignment member> (size=7)
   8	| _Ptr
  	+---
  class std::default_delete<class std::_Facet_base>	size(1):
  	+---
  	+---
  class std::_Get_deleter_pointer_type<class std::_Facet_base,struct std::default_delete<class std::_Facet_base>,void>	size(1):
  	+---
  	+---
  class std::_Compressed_pair<struct std::default_delete<class std::_Facet_base>,class std::_Facet_base *,1>	size(8):
  	+---
   0	| +--- (base class std::default_delete<class std::_Facet_base>)
  	| +---
   0	| _Myval2
  	+---
  class std::unique_ptr<class std::_Facet_base,struct std::default_delete<class std::_Facet_base> >	size(8):
  	+---
   0	| ?$_Compressed_pair@U?$default_delete@V_Facet_base@std@@@std@@PEAV_Facet_base@2@$00 _Mypair
  	+---
  class std::codecvt_base	size(16):
  	+---
   0	| +--- (base class std::locale::facet)
   0	| | +--- (base class std::_Facet_base)
   0	| | | {vfptr}
  	| | +---
   8	| | +--- (base class std::_Crt_new_delete)
  	| | +---
   8	| | _Myrefs
    	| | <alignment member> (size=4)
  	| +---
  	+---
  std::codecvt_base::$vftable@:
  	| &codecvt_base_meta
  	|  0
   0	| &std::codecvt_base::{dtor}
   1	| &std::locale::facet::_Incref
   2	| &std::locale::facet::_Decref
   3	| &std::codecvt_base::do_always_noconv
   4	| &std::codecvt_base::do_max_length
   5	| &std::codecvt_base::do_encoding
  std::codecvt_base::{dtor} this adjustor: 0
  std::codecvt_base::do_always_noconv this adjustor: 0
  std::codecvt_base::do_max_length this adjustor: 0
  std::codecvt_base::do_encoding this adjustor: 0
  std::codecvt_base::__delDtor this adjustor: 0
  std::codecvt_base::__vecDelDtor this adjustor: 0
  class std::codecvt<char16_t,char,struct _Mbstatet>	size(24):
  	+---
   0	| +--- (base class std::codecvt_base)
   0	| | +--- (base class std::locale::facet)
   0	| | | +--- (base class std::_Facet_base)
   0	| | | | {vfptr}
  	| | | +---
   8	| | | +--- (base class std::_Crt_new_delete)
  	| | | +---
   8	| | | _Myrefs
    	| | | <alignment member> (size=4)
  	| | +---
  	| +---
  16	| _Maxcode
  20	| _Codecvt_mode _Mode
  	+---
  std::codecvt<char16_t,char,struct _Mbstatet>::$vftable@:
  	| &?$codecvt@_SDU_Mbstatet@@_meta
  	|  0
   0	| &std::codecvt<char16_t,char,struct _Mbstatet>::{dtor}
   1	| &std::locale::facet::_Incref
   2	| &std::locale::facet::_Decref
   3	| &std::codecvt<char16_t,char,struct _Mbstatet>::do_always_noconv
   4	| &std::codecvt<char16_t,char,struct _Mbstatet>::do_max_length
   5	| &std::codecvt<char16_t,char,struct _Mbstatet>::do_encoding
   6	| &std::codecvt<char16_t,char,struct _Mbstatet>::do_in
   7	| &std::codecvt<char16_t,char,struct _Mbstatet>::do_out
   8	| &std::codecvt<char16_t,char,struct _Mbstatet>::do_unshift
   9	| &std::codecvt<char16_t,char,struct _Mbstatet>::do_length
  std::codecvt<char16_t,char,struct _Mbstatet>::{dtor} this adjustor: 0
  std::codecvt<char16_t,char,struct _Mbstatet>::do_in this adjustor: 0
  std::codecvt<char16_t,char,struct _Mbstatet>::do_out this adjustor: 0
  std::codecvt<char16_t,char,struct _Mbstatet>::do_unshift this adjustor: 0
  std::codecvt<char16_t,char,struct _Mbstatet>::do_length this adjustor: 0
  std::codecvt<char16_t,char,struct _Mbstatet>::do_always_noconv this adjustor: 0
  std::codecvt<char16_t,char,struct _Mbstatet>::do_max_length this adjustor: 0
  std::codecvt<char16_t,char,struct _Mbstatet>::do_encoding this adjustor: 0
  std::codecvt<char16_t,char,struct _Mbstatet>::__delDtor this adjustor: 0
  std::codecvt<char16_t,char,struct _Mbstatet>::__vecDelDtor this adjustor: 0
  class std::codecvt<char32_t,char,struct _Mbstatet>	size(24):
  	+---
   0	| +--- (base class std::codecvt_base)
   0	| | +--- (base class std::locale::facet)
   0	| | | +--- (base class std::_Facet_base)
   0	| | | | {vfptr}
  	| | | +---
   8	| | | +--- (base class std::_Crt_new_delete)
  	| | | +---
   8	| | | _Myrefs
    	| | | <alignment member> (size=4)
  	| | +---
  	| +---
  16	| _Maxcode
  20	| _Codecvt_mode _Mode
  	+---
  std::codecvt<char32_t,char,struct _Mbstatet>::$vftable@:
  	| &?$codecvt@_UDU_Mbstatet@@_meta
  	|  0
   0	| &std::codecvt<char32_t,char,struct _Mbstatet>::{dtor}
   1	| &std::locale::facet::_Incref
   2	| &std::locale::facet::_Decref
   3	| &std::codecvt<char32_t,char,struct _Mbstatet>::do_always_noconv
   4	| &std::codecvt<char32_t,char,struct _Mbstatet>::do_max_length
   5	| &std::codecvt<char32_t,char,struct _Mbstatet>::do_encoding
   6	| &std::codecvt<char32_t,char,struct _Mbstatet>::do_in
   7	| &std::codecvt<char32_t,char,struct _Mbstatet>::do_out
   8	| &std::codecvt<char32_t,char,struct _Mbstatet>::do_unshift
   9	| &std::codecvt<char32_t,char,struct _Mbstatet>::do_length
  std::codecvt<char32_t,char,struct _Mbstatet>::{dtor} this adjustor: 0
  std::codecvt<char32_t,char,struct _Mbstatet>::do_in this adjustor: 0
  std::codecvt<char32_t,char,struct _Mbstatet>::do_out this adjustor: 0
  std::codecvt<char32_t,char,struct _Mbstatet>::do_unshift this adjustor: 0
  std::codecvt<char32_t,char,struct _Mbstatet>::do_length this adjustor: 0
  std::codecvt<char32_t,char,struct _Mbstatet>::do_always_noconv this adjustor: 0
  std::codecvt<char32_t,char,struct _Mbstatet>::do_max_length this adjustor: 0
  std::codecvt<char32_t,char,struct _Mbstatet>::do_encoding this adjustor: 0
  std::codecvt<char32_t,char,struct _Mbstatet>::__delDtor this adjustor: 0
  std::codecvt<char32_t,char,struct _Mbstatet>::__vecDelDtor this adjustor: 0
  class std::codecvt<wchar_t,char,struct _Mbstatet>	size(64):
  	+---
   0	| +--- (base class std::codecvt_base)
   0	| | +--- (base class std::locale::facet)
   0	| | | +--- (base class std::_Facet_base)
   0	| | | | {vfptr}
  	| | | +---
   8	| | | +--- (base class std::_Crt_new_delete)
  	| | | +---
   8	| | | _Myrefs
    	| | | <alignment member> (size=4)
  	| | +---
  	| +---
  16	| _Cvtvec _Cvt
    	| <alignment member> (size=4)
  	+---
  std::codecvt<wchar_t,char,struct _Mbstatet>::$vftable@:
  	| &?$codecvt@_WDU_Mbstatet@@_meta
  	|  0
   0	| &std::codecvt<wchar_t,char,struct _Mbstatet>::{dtor}
   1	| &std::locale::facet::_Incref
   2	| &std::locale::facet::_Decref
   3	| &std::codecvt<wchar_t,char,struct _Mbstatet>::do_always_noconv
   4	| &std::codecvt<wchar_t,char,struct _Mbstatet>::do_max_length
   5	| &std::codecvt<wchar_t,char,struct _Mbstatet>::do_encoding
   6	| &std::codecvt<wchar_t,char,struct _Mbstatet>::do_in
   7	| &std::codecvt<wchar_t,char,struct _Mbstatet>::do_out
   8	| &std::codecvt<wchar_t,char,struct _Mbstatet>::do_unshift
   9	| &std::codecvt<wchar_t,char,struct _Mbstatet>::do_length
  std::codecvt<wchar_t,char,struct _Mbstatet>::{dtor} this adjustor: 0
  std::codecvt<wchar_t,char,struct _Mbstatet>::do_in this adjustor: 0
  std::codecvt<wchar_t,char,struct _Mbstatet>::do_out this adjustor: 0
  std::codecvt<wchar_t,char,struct _Mbstatet>::do_unshift this adjustor: 0
  std::codecvt<wchar_t,char,struct _Mbstatet>::do_length this adjustor: 0
  std::codecvt<wchar_t,char,struct _Mbstatet>::do_always_noconv this adjustor: 0
  std::codecvt<wchar_t,char,struct _Mbstatet>::do_max_length this adjustor: 0
  std::codecvt<wchar_t,char,struct _Mbstatet>::do_encoding this adjustor: 0
  std::codecvt<wchar_t,char,struct _Mbstatet>::__delDtor this adjustor: 0
  std::codecvt<wchar_t,char,struct _Mbstatet>::__vecDelDtor this adjustor: 0
  class std::codecvt<unsigned short,char,struct _Mbstatet>	size(64):
  	+---
   0	| +--- (base class std::codecvt_base)
   0	| | +--- (base class std::locale::facet)
   0	| | | +--- (base class std::_Facet_base)
   0	| | | | {vfptr}
  	| | | +---
   8	| | | +--- (base class std::_Crt_new_delete)
  	| | | +---
   8	| | | _Myrefs
    	| | | <alignment member> (size=4)
  	| | +---
  	| +---
  16	| _Cvtvec _Cvt
    	| <alignment member> (size=4)
  	+---
  std::codecvt<unsigned short,char,struct _Mbstatet>::$vftable@:
  	| &?$codecvt@GDU_Mbstatet@@_meta
  	|  0
   0	| &std::codecvt<unsigned short,char,struct _Mbstatet>::{dtor}
   1	| &std::locale::facet::_Incref
   2	| &std::locale::facet::_Decref
   3	| &std::codecvt<unsigned short,char,struct _Mbstatet>::do_always_noconv
   4	| &std::codecvt<unsigned short,char,struct _Mbstatet>::do_max_length
   5	| &std::codecvt<unsigned short,char,struct _Mbstatet>::do_encoding
   6	| &std::codecvt<unsigned short,char,struct _Mbstatet>::do_in
   7	| &std::codecvt<unsigned short,char,struct _Mbstatet>::do_out
   8	| &std::codecvt<unsigned short,char,struct _Mbstatet>::do_unshift
   9	| &std::codecvt<unsigned short,char,struct _Mbstatet>::do_length
  std::codecvt<unsigned short,char,struct _Mbstatet>::{dtor} this adjustor: 0
  std::codecvt<unsigned short,char,struct _Mbstatet>::do_in this adjustor: 0
  std::codecvt<unsigned short,char,struct _Mbstatet>::do_out this adjustor: 0
  std::codecvt<unsigned short,char,struct _Mbstatet>::do_unshift this adjustor: 0
  std::codecvt<unsigned short,char,struct _Mbstatet>::do_length this adjustor: 0
  std::codecvt<unsigned short,char,struct _Mbstatet>::do_always_noconv this adjustor: 0
  std::codecvt<unsigned short,char,struct _Mbstatet>::do_max_length this adjustor: 0
  std::codecvt<unsigned short,char,struct _Mbstatet>::do_encoding this adjustor: 0
  std::codecvt<unsigned short,char,struct _Mbstatet>::__delDtor this adjustor: 0
  std::codecvt<unsigned short,char,struct _Mbstatet>::__vecDelDtor this adjustor: 0
  class std::ctype_base	size(16):
  	+---
   0	| +--- (base class std::locale::facet)
   0	| | +--- (base class std::_Facet_base)
   0	| | | {vfptr}
  	| | +---
   8	| | +--- (base class std::_Crt_new_delete)
  	| | +---
   8	| | _Myrefs
    	| | <alignment member> (size=4)
  	| +---
  	+---
  std::ctype_base::$vftable@:
  	| &ctype_base_meta
  	|  0
   0	| &std::ctype_base::{dtor}
   1	| &std::locale::facet::_Incref
   2	| &std::locale::facet::_Decref
  std::ctype_base::{dtor} this adjustor: 0
  std::ctype_base::__delDtor this adjustor: 0
  std::ctype_base::__vecDelDtor this adjustor: 0
  class std::ctype<char>	size(48):
  	+---
   0	| +--- (base class std::ctype_base)
   0	| | +--- (base class std::locale::facet)
   0	| | | +--- (base class std::_Facet_base)
   0	| | | | {vfptr}
  	| | | +---
   8	| | | +--- (base class std::_Crt_new_delete)
  	| | | +---
   8	| | | _Myrefs
    	| | | <alignment member> (size=4)
  	| | +---
  	| +---
  16	| _Ctypevec _Ctype
  	+---
  std::ctype<char>::$vftable@:
  	| &?$ctype@D_meta
  	|  0
   0	| &std::ctype<char>::{dtor}
   1	| &std::locale::facet::_Incref
   2	| &std::locale::facet::_Decref
   3	| &std::ctype<char>::do_tolower
   4	| &std::ctype<char>::do_tolower
   5	| &std::ctype<char>::do_toupper
   6	| &std::ctype<char>::do_toupper
   7	| &std::ctype<char>::do_widen
   8	| &std::ctype<char>::do_widen
   9	| &std::ctype<char>::do_narrow
  10	| &std::ctype<char>::do_narrow
  std::ctype<char>::{dtor} this adjustor: 0
  std::ctype<char>::do_tolower this adjustor: 0
  std::ctype<char>::do_tolower this adjustor: 0
  std::ctype<char>::do_toupper this adjustor: 0
  std::ctype<char>::do_toupper this adjustor: 0
  std::ctype<char>::do_widen this adjustor: 0
  std::ctype<char>::do_widen this adjustor: 0
  std::ctype<char>::do_narrow this adjustor: 0
  std::ctype<char>::do_narrow this adjustor: 0
  std::ctype<char>::__delDtor this adjustor: 0
  std::ctype<char>::__vecDelDtor this adjustor: 0
  class std::ctype<wchar_t>	size(96):
  	+---
   0	| +--- (base class std::ctype_base)
   0	| | +--- (base class std::locale::facet)
   0	| | | +--- (base class std::_Facet_base)
   0	| | | | {vfptr}
  	| | | +---
   8	| | | +--- (base class std::_Crt_new_delete)
  	| | | +---
   8	| | | _Myrefs
    	| | | <alignment member> (size=4)
  	| | +---
  	| +---
  16	| _Ctypevec _Ctype
  48	| _Cvtvec _Cvt
    	| <alignment member> (size=4)
  	+---
  std::ctype<wchar_t>::$vftable@:
  	| &?$ctype@_W_meta
  	|  0
   0	| &std::ctype<wchar_t>::{dtor}
   1	| &std::locale::facet::_Incref
   2	| &std::locale::facet::_Decref
   3	| &std::ctype<wchar_t>::do_is
   4	| &std::ctype<wchar_t>::do_is
   5	| &std::ctype<wchar_t>::do_scan_is
   6	| &std::ctype<wchar_t>::do_scan_not
   7	| &std::ctype<wchar_t>::do_tolower
   8	| &std::ctype<wchar_t>::do_tolower
   9	| &std::ctype<wchar_t>::do_toupper
  10	| &std::ctype<wchar_t>::do_toupper
  11	| &std::ctype<wchar_t>::do_widen
  12	| &std::ctype<wchar_t>::do_widen
  13	| &std::ctype<wchar_t>::do_narrow
  14	| &std::ctype<wchar_t>::do_narrow
  std::ctype<wchar_t>::{dtor} this adjustor: 0
  std::ctype<wchar_t>::do_is this adjustor: 0
  std::ctype<wchar_t>::do_is this adjustor: 0
  std::ctype<wchar_t>::do_scan_is this adjustor: 0
  std::ctype<wchar_t>::do_scan_not this adjustor: 0
  std::ctype<wchar_t>::do_tolower this adjustor: 0
  std::ctype<wchar_t>::do_tolower this adjustor: 0
  std::ctype<wchar_t>::do_toupper this adjustor: 0
  std::ctype<wchar_t>::do_toupper this adjustor: 0
  std::ctype<wchar_t>::do_widen this adjustor: 0
  std::ctype<wchar_t>::do_widen this adjustor: 0
  std::ctype<wchar_t>::do_narrow this adjustor: 0
  std::ctype<wchar_t>::do_narrow this adjustor: 0
  std::ctype<wchar_t>::__delDtor this adjustor: 0
  std::ctype<wchar_t>::__vecDelDtor this adjustor: 0
  class std::ctype<unsigned short>	size(96):
  	+---
   0	| +--- (base class std::ctype_base)
   0	| | +--- (base class std::locale::facet)
   0	| | | +--- (base class std::_Facet_base)
   0	| | | | {vfptr}
  	| | | +---
   8	| | | +--- (base class std::_Crt_new_delete)
  	| | | +---
   8	| | | _Myrefs
    	| | | <alignment member> (size=4)
  	| | +---
  	| +---
  16	| _Ctypevec _Ctype
  48	| _Cvtvec _Cvt
    	| <alignment member> (size=4)
  	+---
  std::ctype<unsigned short>::$vftable@:
  	| &?$ctype@G_meta
  	|  0
   0	| &std::ctype<unsigned short>::{dtor}
   1	| &std::locale::facet::_Incref
   2	| &std::locale::facet::_Decref
   3	| &std::ctype<unsigned short>::do_is
   4	| &std::ctype<unsigned short>::do_is
   5	| &std::ctype<unsigned short>::do_scan_is
   6	| &std::ctype<unsigned short>::do_scan_not
   7	| &std::ctype<unsigned short>::do_tolower
   8	| &std::ctype<unsigned short>::do_tolower
   9	| &std::ctype<unsigned short>::do_toupper
  10	| &std::ctype<unsigned short>::do_toupper
  11	| &std::ctype<unsigned short>::do_widen
  12	| &std::ctype<unsigned short>::do_widen
  13	| &std::ctype<unsigned short>::do_narrow
  14	| &std::ctype<unsigned short>::do_narrow
  std::ctype<unsigned short>::{dtor} this adjustor: 0
  std::ctype<unsigned short>::do_is this adjustor: 0
  std::ctype<unsigned short>::do_is this adjustor: 0
  std::ctype<unsigned short>::do_scan_is this adjustor: 0
  std::ctype<unsigned short>::do_scan_not this adjustor: 0
  std::ctype<unsigned short>::do_tolower this adjustor: 0
  std::ctype<unsigned short>::do_tolower this adjustor: 0
  std::ctype<unsigned short>::do_toupper this adjustor: 0
  std::ctype<unsigned short>::do_toupper this adjustor: 0
  std::ctype<unsigned short>::do_widen this adjustor: 0
  std::ctype<unsigned short>::do_widen this adjustor: 0
  std::ctype<unsigned short>::do_narrow this adjustor: 0
  std::ctype<unsigned short>::do_narrow this adjustor: 0
  std::ctype<unsigned short>::__delDtor this adjustor: 0
  std::ctype<unsigned short>::__vecDelDtor this adjustor: 0
  class std::codecvt<char,char,struct _Mbstatet>	size(16):
  	+---
   0	| +--- (base class std::codecvt_base)
   0	| | +--- (base class std::locale::facet)
   0	| | | +--- (base class std::_Facet_base)
   0	| | | | {vfptr}
  	| | | +---
   8	| | | +--- (base class std::_Crt_new_delete)
  	| | | +---
   8	| | | _Myrefs
    	| | | <alignment member> (size=4)
  	| | +---
  	| +---
  	+---
  std::codecvt<char,char,struct _Mbstatet>::$vftable@:
  	| &?$codecvt@DDU_Mbstatet@@_meta
  	|  0
   0	| &std::codecvt<char,char,struct _Mbstatet>::{dtor}
   1	| &std::locale::facet::_Incref
   2	| &std::locale::facet::_Decref
   3	| &std::codecvt<char,char,struct _Mbstatet>::do_always_noconv
   4	| &std::codecvt_base::do_max_length
   5	| &std::codecvt_base::do_encoding
   6	| &std::codecvt<char,char,struct _Mbstatet>::do_in
   7	| &std::codecvt<char,char,struct _Mbstatet>::do_out
   8	| &std::codecvt<char,char,struct _Mbstatet>::do_unshift
   9	| &std::codecvt<char,char,struct _Mbstatet>::do_length
  std::codecvt<char,char,struct _Mbstatet>::{dtor} this adjustor: 0
  std::codecvt<char,char,struct _Mbstatet>::do_always_noconv this adjustor: 0
  std::codecvt<char,char,struct _Mbstatet>::do_in this adjustor: 0
  std::codecvt<char,char,struct _Mbstatet>::do_out this adjustor: 0
  std::codecvt<char,char,struct _Mbstatet>::do_unshift this adjustor: 0
  std::codecvt<char,char,struct _Mbstatet>::do_length this adjustor: 0
  std::codecvt<char,char,struct _Mbstatet>::__delDtor this adjustor: 0
  std::codecvt<char,char,struct _Mbstatet>::__vecDelDtor this adjustor: 0
  class std::_Iosb<int>	size(1):
  	+---
  	+---
  class std::ios_base::failure	size(40):
  	+---
   0	| +--- (base class std::system_error)
   0	| | +--- (base class std::_System_error)
   0	| | | +--- (base class std::runtime_error)
   0	| | | | +--- (base class std::exception)
   0	| | | | | {vfptr}
   8	| | | | | __std_exception_data _Data
  	| | | | +---
  	| | | +---
  24	| | | error_code _Mycode
  	| | +---
  	| +---
  	+---
  std::ios_base::failure::$vftable@:
  	| &failure_meta
  	|  0
   0	| &std::ios_base::failure::{dtor}
   1	| &std::exception::what
  std::ios_base::failure::{dtor} this adjustor: 0
  std::ios_base::failure::__delDtor this adjustor: 0
  std::ios_base::failure::__vecDelDtor this adjustor: 0
  class std::ios_base::Init	size(1):
  	+---
  	+---
  class std::ios_base::_Iosarray	size(24):
  	+---
   0	| +--- (base class std::_Crt_new_delete)
  	| +---
   0	| _Next
   8	| _Index
  12	| _Lo
  16	| _Vp
  	+---
  class std::ios_base::_Fnarray	size(24):
  	+---
   0	| +--- (base class std::_Crt_new_delete)
  	| +---
   0	| _Next
   8	| _Index
    	| <alignment member> (size=4)
  16	| _Pfn
  	+---
  class std::ios_base	size(72):
  	+---
   0	| {vfptr}
   8	| +--- (base class std::_Iosb<int>)
  	| +---
   8	| _Stdstr
  16	| _Mystate
  20	| _Except
  24	| _Fmtfl
    	| <alignment member> (size=4)
  32	| _Prec
  40	| _Wide
  48	| _Arr
  56	| _Calls
  64	| _Ploc
  	+---
  std::ios_base::$vftable@:
  	| &ios_base_meta
  	|  0
   0	| &std::ios_base::{dtor}
  std::ios_base::{dtor} this adjustor: 0
  std::ios_base::__delDtor this adjustor: 0
  std::ios_base::__vecDelDtor this adjustor: 0
  class std::basic_streambuf<char,struct std::char_traits<char> >	size(104):
  	+---
   0	| {vfptr}
   8	| _Gfirst
  16	| _Pfirst
  24	| _IGfirst
  32	| _IPfirst
  40	| _Gnext
  48	| _Pnext
  56	| _IGnext
  64	| _IPnext
  72	| _Gcount
  76	| _Pcount
  80	| _IGcount
  88	| _IPcount
  96	| _Plocale
  	+---
  std::basic_streambuf<char,struct std::char_traits<char> >::$vftable@:
  	| &?$basic_streambuf@DU?$char_traits@D@std@@_meta
  	|  0
   0	| &std::basic_streambuf<char,struct std::char_traits<char> >::{dtor}
   1	| &std::basic_streambuf<char,struct std::char_traits<char> >::_Lock
   2	| &std::basic_streambuf<char,struct std::char_traits<char> >::_Unlock
   3	| &std::basic_streambuf<char,struct std::char_traits<char> >::overflow
   4	| &std::basic_streambuf<char,struct std::char_traits<char> >::pbackfail
   5	| &std::basic_streambuf<char,struct std::char_traits<char> >::showmanyc
   6	| &std::basic_streambuf<char,struct std::char_traits<char> >::underflow
   7	| &std::basic_streambuf<char,struct std::char_traits<char> >::uflow
   8	| &std::basic_streambuf<char,struct std::char_traits<char> >::xsgetn
   9	| &std::basic_streambuf<char,struct std::char_traits<char> >::xsputn
  10	| &std::basic_streambuf<char,struct std::char_traits<char> >::seekoff
  11	| &std::basic_streambuf<char,struct std::char_traits<char> >::seekpos
  12	| &std::basic_streambuf<char,struct std::char_traits<char> >::setbuf
  13	| &std::basic_streambuf<char,struct std::char_traits<char> >::sync
  14	| &std::basic_streambuf<char,struct std::char_traits<char> >::imbue
  std::basic_streambuf<char,struct std::char_traits<char> >::{dtor} this adjustor: 0
  std::basic_streambuf<char,struct std::char_traits<char> >::_Lock this adjustor: 0
  std::basic_streambuf<char,struct std::char_traits<char> >::_Unlock this adjustor: 0
  std::basic_streambuf<char,struct std::char_traits<char> >::overflow this adjustor: 0
  std::basic_streambuf<char,struct std::char_traits<char> >::pbackfail this adjustor: 0
  std::basic_streambuf<char,struct std::char_traits<char> >::showmanyc this adjustor: 0
  std::basic_streambuf<char,struct std::char_traits<char> >::underflow this adjustor: 0
  std::basic_streambuf<char,struct std::char_traits<char> >::uflow this adjustor: 0
  std::basic_streambuf<char,struct std::char_traits<char> >::xsgetn this adjustor: 0
  std::basic_streambuf<char,struct std::char_traits<char> >::xsputn this adjustor: 0
  std::basic_streambuf<char,struct std::char_traits<char> >::seekoff this adjustor: 0
  std::basic_streambuf<char,struct std::char_traits<char> >::seekpos this adjustor: 0
  std::basic_streambuf<char,struct std::char_traits<char> >::setbuf this adjustor: 0
  std::basic_streambuf<char,struct std::char_traits<char> >::sync this adjustor: 0
  std::basic_streambuf<char,struct std::char_traits<char> >::imbue this adjustor: 0
  std::basic_streambuf<char,struct std::char_traits<char> >::__delDtor this adjustor: 0
  std::basic_streambuf<char,struct std::char_traits<char> >::__vecDelDtor this adjustor: 0
  class std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >	size(104):
  	+---
   0	| {vfptr}
   8	| _Gfirst
  16	| _Pfirst
  24	| _IGfirst
  32	| _IPfirst
  40	| _Gnext
  48	| _Pnext
  56	| _IGnext
  64	| _IPnext
  72	| _Gcount
  76	| _Pcount
  80	| _IGcount
  88	| _IPcount
  96	| _Plocale
  	+---
  std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::$vftable@:
  	| &?$basic_streambuf@_WU?$char_traits@_W@std@@_meta
  	|  0
   0	| &std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::{dtor}
   1	| &std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::_Lock
   2	| &std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::_Unlock
   3	| &std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::overflow
   4	| &std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::pbackfail
   5	| &std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::showmanyc
   6	| &std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::underflow
   7	| &std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::uflow
   8	| &std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::xsgetn
   9	| &std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::xsputn
  10	| &std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::seekoff
  11	| &std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::seekpos
  12	| &std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::setbuf
  13	| &std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::sync
  14	| &std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::imbue
  std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::{dtor} this adjustor: 0
  std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::_Lock this adjustor: 0
  std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::_Unlock this adjustor: 0
  std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::overflow this adjustor: 0
  std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::pbackfail this adjustor: 0
  std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::showmanyc this adjustor: 0
  std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::underflow this adjustor: 0
  std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::uflow this adjustor: 0
  std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::xsgetn this adjustor: 0
  std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::xsputn this adjustor: 0
  std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::seekoff this adjustor: 0
  std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::seekpos this adjustor: 0
  std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::setbuf this adjustor: 0
  std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::sync this adjustor: 0
  std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::imbue this adjustor: 0
  std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::__delDtor this adjustor: 0
  std::basic_streambuf<wchar_t,struct std::char_traits<wchar_t> >::__vecDelDtor this adjustor: 0
  class std::numpunct<char>	size(48):
  	+---
   0	| +--- (base class std::locale::facet)
   0	| | +--- (base class std::_Facet_base)
   0	| | | {vfptr}
  	| | +---
   8	| | +--- (base class std::_Crt_new_delete)
  	| | +---
   8	| | _Myrefs
    	| | <alignment member> (size=4)
  	| +---
  16	| _Grouping
  24	| _Dp
  25	| _Kseparator
    	| <alignment member> (size=6)
  32	| _Falsename
  40	| _Truename
  	+---
  std::numpunct<char>::$vftable@:
  	| &?$numpunct@D_meta
  	|  0
   0	| &std::numpunct<char>::{dtor}
   1	| &std::locale::facet::_Incref
   2	| &std::locale::facet::_Decref
   3	| &std::numpunct<char>::do_decimal_point
   4	| &std::numpunct<char>::do_thousands_sep
   5	| &std::numpunct<char>::do_grouping
   6	| &std::numpunct<char>::do_falsename
   7	| &std::numpunct<char>::do_truename
  std::numpunct<char>::{dtor} this adjustor: 0
  std::numpunct<char>::do_decimal_point this adjustor: 0
  std::numpunct<char>::do_thousands_sep this adjustor: 0
  std::numpunct<char>::do_grouping this adjustor: 0
  std::numpunct<char>::do_falsename this adjustor: 0
  std::numpunct<char>::do_truename this adjustor: 0
  std::numpunct<char>::__delDtor this adjustor: 0
  std::numpunct<char>::__vecDelDtor this adjustor: 0
  class std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >	size(16):
  	+---
   0	| +--- (base class std::locale::facet)
   0	| | +--- (base class std::_Facet_base)
   0	| | | {vfptr}
  	| | +---
   8	| | +--- (base class std::_Crt_new_delete)
  	| | +---
   8	| | _Myrefs
    	| | <alignment member> (size=4)
  	| +---
  	+---
  std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::$vftable@:
  	| &?$num_get@DV?$istreambuf_iterator@DU?$char_traits@D@std@@@std@@_meta
  	|  0
   0	| &std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::{dtor}
   1	| &std::locale::facet::_Incref
   2	| &std::locale::facet::_Decref
   3	| &std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get
   4	| &std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get
   5	| &std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get
   6	| &std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get
   7	| &std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get
   8	| &std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get
   9	| &std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get
  10	| &std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get
  11	| &std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get
  12	| &std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get
  13	| &std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get
  std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::{dtor} this adjustor: 0
  std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get this adjustor: 0
  std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get this adjustor: 0
  std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get this adjustor: 0
  std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get this adjustor: 0
  std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get this adjustor: 0
  std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get this adjustor: 0
  std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get this adjustor: 0
  std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get this adjustor: 0
  std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get this adjustor: 0
  std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get this adjustor: 0
  std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::do_get this adjustor: 0
  std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::__delDtor this adjustor: 0
  std::num_get<char,class std::istreambuf_iterator<char,struct std::char_traits<char> > >::__vecDelDtor this adjustor: 0
  class std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >	size(16):
  	+---
   0	| +--- (base class std::locale::facet)
   0	| | +--- (base class std::_Facet_base)
   0	| | | {vfptr}
  	| | +---
   8	| | +--- (base class std::_Crt_new_delete)
  	| | +---
   8	| | _Myrefs
    	| | <alignment member> (size=4)
  	| +---
  	+---
  std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::$vftable@:
  	| &?$num_put@DV?$ostreambuf_iterator@DU?$char_traits@D@std@@@std@@_meta
  	|  0
   0	| &std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::{dtor}
   1	| &std::locale::facet::_Incref
   2	| &std::locale::facet::_Decref
   3	| &std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::do_put
   4	| &std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::do_put
   5	| &std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::do_put
   6	| &std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::do_put
   7	| &std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::do_put
   8	| &std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::do_put
   9	| &std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::do_put
  10	| &std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::do_put
  std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::{dtor} this adjustor: 0
  std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::do_put this adjustor: 0
  std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::do_put this adjustor: 0
  std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::do_put this adjustor: 0
  std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::do_put this adjustor: 0
  std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::do_put this adjustor: 0
  std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::do_put this adjustor: 0
  std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::do_put this adjustor: 0
  std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::do_put this adjustor: 0
  std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::__delDtor this adjustor: 0
  std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > >::__vecDelDtor this adjustor: 0
  class std::numpunct<wchar_t>	size(48):
  	+---
   0	| +--- (base class std::locale::facet)
   0	| | +--- (base class std::_Facet_base)
   0	| | | {vfptr}
  	| | +---
   8	| | +--- (base class std::_Crt_new_delete)
  	| | +---
   8	| | _Myrefs
    	| | <alignment member> (size=4)
  	| +---
  16	| _Grouping
  24	| _Dp
  26	| _Kseparator
    	| <alignment member> (size=4)
  32	| _Falsename
  40	| _Truename
  	+---
  std::numpunct<wchar_t>::$vftable@:
  	| &?$numpunct@_W_meta
  	|  0
   0	| &std::numpunct<wchar_t>::{dtor}
   1	| &std::locale::facet::_Incref
   2	| &std::locale::facet::_Decref
   3	| &std::numpunct<wchar_t>::do_decimal_point
   4	| &std::numpunct<wchar_t>::do_thousands_sep
   5	| &std::numpunct<wchar_t>::do_grouping
   6	| &std::numpunct<wchar_t>::do_falsename
   7	| &std::numpunct<wchar_t>::do_truename
  std::numpunct<wchar_t>::{dtor} this adjustor: 0
  std::numpunct<wchar_t>::do_decimal_point this adjustor: 0
  std::numpunct<wchar_t>::do_thousands_sep this adjustor: 0
  std::numpunct<wchar_t>::do_grouping this adjustor: 0
  std::numpunct<wchar_t>::do_falsename this adjustor: 0
  std::numpunct<wchar_t>::do_truename this adjustor: 0
  std::numpunct<wchar_t>::__delDtor this adjustor: 0
  std::numpunct<wchar_t>::__vecDelDtor this adjustor: 0
  class std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >	size(16):
  	+---
   0	| +--- (base class std::locale::facet)
   0	| | +--- (base class std::_Facet_base)
   0	| | | {vfptr}
  	| | +---
   8	| | +--- (base class std::_Crt_new_delete)
  	| | +---
   8	| | _Myrefs
    	| | <alignment member> (size=4)
  	| +---
  	+---
  std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::$vftable@:
  	| &?$num_get@_WV?$istreambuf_iterator@_WU?$char_traits@_W@std@@@std@@_meta
  	|  0
   0	| &std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::{dtor}
   1	| &std::locale::facet::_Incref
   2	| &std::locale::facet::_Decref
   3	| &std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get
   4	| &std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get
   5	| &std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get
   6	| &std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get
   7	| &std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get
   8	| &std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get
   9	| &std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get
  10	| &std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get
  11	| &std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get
  12	| &std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get
  13	| &std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get
  std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::{dtor} this adjustor: 0
  std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get this adjustor: 0
  std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get this adjustor: 0
  std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get this adjustor: 0
  std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get this adjustor: 0
  std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get this adjustor: 0
  std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get this adjustor: 0
  std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get this adjustor: 0
  std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get this adjustor: 0
  std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get this adjustor: 0
  std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get this adjustor: 0
  std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_get this adjustor: 0
  std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::__delDtor this adjustor: 0
  std::num_get<wchar_t,class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::__vecDelDtor this adjustor: 0
  class std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >	size(16):
  	+---
   0	| +--- (base class std::locale::facet)
   0	| | +--- (base class std::_Facet_base)
   0	| | | {vfptr}
  	| | +---
   8	| | +--- (base class std::_Crt_new_delete)
  	| | +---
   8	| | _Myrefs
    	| | <alignment member> (size=4)
  	| +---
  	+---
  std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::$vftable@:
  	| &?$num_put@_WV?$ostreambuf_iterator@_WU?$char_traits@_W@std@@@std@@_meta
  	|  0
   0	| &std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::{dtor}
   1	| &std::locale::facet::_Incref
   2	| &std::locale::facet::_Decref
   3	| &std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_put
   4	| &std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_put
   5	| &std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_put
   6	| &std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_put
   7	| &std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_put
   8	| &std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_put
   9	| &std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_put
  10	| &std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_put
  std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::{dtor} this adjustor: 0
  std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_put this adjustor: 0
  std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_put this adjustor: 0
  std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_put this adjustor: 0
  std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_put this adjustor: 0
  std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_put this adjustor: 0
  std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_put this adjustor: 0
  std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_put this adjustor: 0
  std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::do_put this adjustor: 0
  std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::__delDtor this adjustor: 0
  std::num_put<wchar_t,class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> > >::__vecDelDtor this adjustor: 0
  class std::basic_ios<char,struct std::char_traits<char> >	size(96):
  	+---
   0	| +--- (base class std::ios_base)
   0	| | {vfptr}
   8	| | +--- (base class std::_Iosb<int>)
  	| | +---
   8	| | _Stdstr
  16	| | _Mystate
  20	| | _Except
  24	| | _Fmtfl
    	| | <alignment member> (size=4)
  32	| | _Prec
  40	| | _Wide
  48	| | _Arr
  56	| | _Calls
  64	| | _Ploc
  	| +---
  72	| _Mystrbuf
  80	| _Tiestr
  88	| _Fillch
    	| <alignment member> (size=7)
  	+---
  std::basic_ios<char,struct std::char_traits<char> >::$vftable@:
  	| &?$basic_ios@DU?$char_traits@D@std@@_meta
  	|  0
   0	| &std::basic_ios<char,struct std::char_traits<char> >::{dtor}
  std::basic_ios<char,struct std::char_traits<char> >::{dtor} this adjustor: 0
  std::basic_ios<char,struct std::char_traits<char> >::__delDtor this adjustor: 0
  std::basic_ios<char,struct std::char_traits<char> >::__vecDelDtor this adjustor: 0
  class std::basic_ios<wchar_t,struct std::char_traits<wchar_t> >	size(96):
  	+---
   0	| +--- (base class std::ios_base)
   0	| | {vfptr}
   8	| | +--- (base class std::_Iosb<int>)
  	| | +---
   8	| | _Stdstr
  16	| | _Mystate
  20	| | _Except
  24	| | _Fmtfl
    	| | <alignment member> (size=4)
  32	| | _Prec
  40	| | _Wide
  48	| | _Arr
  56	| | _Calls
  64	| | _Ploc
  	| +---
  72	| _Mystrbuf
  80	| _Tiestr
  88	| _Fillch
    	| <alignment member> (size=6)
  	+---
  std::basic_ios<wchar_t,struct std::char_traits<wchar_t> >::$vftable@:
  	| &?$basic_ios@_WU?$char_traits@_W@std@@_meta
  	|  0
   0	| &std::basic_ios<wchar_t,struct std::char_traits<wchar_t> >::{dtor}
  std::basic_ios<wchar_t,struct std::char_traits<wchar_t> >::{dtor} this adjustor: 0
  std::basic_ios<wchar_t,struct std::char_traits<wchar_t> >::__delDtor this adjustor: 0
  std::basic_ios<wchar_t,struct std::char_traits<wchar_t> >::__vecDelDtor this adjustor: 0
  class std::basic_ostream<`template-type-parameter-1',`template-type-parameter-2'>::_Sentry_base	size(4):
  	+---
   0	| _Myostr
  	+---
  class std::basic_ostream<`template-type-parameter-1',`template-type-parameter-2'>::sentry	size(4):
  	+---
   0	| +--- (base class std::basic_ostream<`template-type-parameter-1',`template-type-parameter-2'>::_Sentry_base)
   0	| | _Myostr
  	| +---
   0	| _Ok
  	+---
  class std::basic_ostream<char,struct std::char_traits<char> >	size(112):
  	+---
   0	| {vbptr}
    	| <alignment member> (size=4)
  	+---
  12	| (vtordisp for vbase std::basic_ios<char,struct std::char_traits<char> >)
  	+--- (virtual base std::basic_ios<char,struct std::char_traits<char> >)
  16	| +--- (base class std::ios_base)
  16	| | {vfptr}
  24	| | +--- (base class std::_Iosb<int>)
  	| | +---
  24	| | _Stdstr
  32	| | _Mystate
  36	| | _Except
  40	| | _Fmtfl
    	| | <alignment member> (size=4)
  48	| | _Prec
  56	| | _Wide
  64	| | _Arr
  72	| | _Calls
  80	| | _Ploc
  	| +---
  88	| _Mystrbuf
  96	| _Tiestr
  104	| _Fillch
    	| <alignment member> (size=7)
  	+---
  std::basic_ostream<char,struct std::char_traits<char> >::$vbtable@:
   0	| 0
   1	| 16 (?$basic_ostream@DU?$char_traits@D@std@@d(?$basic_ostream@DU?$char_traits@D@std@@+0)?$basic_ios@DU?$char_traits@D@std@@)
  std::basic_ostream<char,struct std::char_traits<char> >::$vftable@:
  	| -16
   0	| &(vtordisp) std::basic_ostream<char,struct std::char_traits<char> >::{dtor}
  std::basic_ostream<char,struct std::char_traits<char> >::{dtor} this adjustor: 16
  std::basic_ostream<char,struct std::char_traits<char> >::__delDtor this adjustor: 16
  std::basic_ostream<char,struct std::char_traits<char> >::__vecDelDtor this adjustor: 16
  vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
  std::basic_ios<char,struct std::char_traits<char> >      16       0       4 1
  class std::basic_ostream<wchar_t,struct std::char_traits<wchar_t> >	size(112):
  	+---
   0	| {vbptr}
    	| <alignment member> (size=4)
  	+---
  12	| (vtordisp for vbase std::basic_ios<wchar_t,struct std::char_traits<wchar_t> >)
  	+--- (virtual base std::basic_ios<wchar_t,struct std::char_traits<wchar_t> >)
  16	| +--- (base class std::ios_base)
  16	| | {vfptr}
  24	| | +--- (base class std::_Iosb<int>)
  	| | +---
  24	| | _Stdstr
  32	| | _Mystate
  36	| | _Except
  40	| | _Fmtfl
    	| | <alignment member> (size=4)
  48	| | _Prec
  56	| | _Wide
  64	| | _Arr
  72	| | _Calls
  80	| | _Ploc
  	| +---
  88	| _Mystrbuf
  96	| _Tiestr
  104	| _Fillch
    	| <alignment member> (size=6)
  	+---
  std::basic_ostream<wchar_t,struct std::char_traits<wchar_t> >::$vbtable@:
   0	| 0
   1	| 16 (?$basic_ostream@_WU?$char_traits@_W@std@@d(?$basic_ostream@_WU?$char_traits@_W@std@@+0)?$basic_ios@_WU?$char_traits@_W@std@@)
  std::basic_ostream<wchar_t,struct std::char_traits<wchar_t> >::$vftable@:
  	| -16
   0	| &(vtordisp) std::basic_ostream<wchar_t,struct std::char_traits<wchar_t> >::{dtor}
  std::basic_ostream<wchar_t,struct std::char_traits<wchar_t> >::{dtor} this adjustor: 16
  std::basic_ostream<wchar_t,struct std::char_traits<wchar_t> >::__delDtor this adjustor: 16
  std::basic_ostream<wchar_t,struct std::char_traits<wchar_t> >::__vecDelDtor this adjustor: 16
  vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
  std::basic_ios<wchar_t,struct std::char_traits<wchar_t> >      16       0       4 1
  class std::basic_istream<`template-type-parameter-1',`template-type-parameter-2'>::_Sentry_base	size(4):
  	+---
   0	| _Myistr
  	+---
  class std::basic_istream<`template-type-parameter-1',`template-type-parameter-2'>::sentry	size(4):
  	+---
   0	| +--- (base class std::basic_istream<`template-type-parameter-1',`template-type-parameter-2'>::_Sentry_base)
   0	| | _Myistr
  	| +---
   0	| _Ok
  	+---
  class std::basic_istream<char,struct std::char_traits<char> >	size(120):
  	+---
   0	| {vbptr}
   8	| _Chcount
    	| <alignment member> (size=4)
  	+---
  20	| (vtordisp for vbase std::basic_ios<char,struct std::char_traits<char> >)
  	+--- (virtual base std::basic_ios<char,struct std::char_traits<char> >)
  24	| +--- (base class std::ios_base)
  24	| | {vfptr}
  32	| | +--- (base class std::_Iosb<int>)
  	| | +---
  32	| | _Stdstr
  40	| | _Mystate
  44	| | _Except
  48	| | _Fmtfl
    	| | <alignment member> (size=4)
  56	| | _Prec
  64	| | _Wide
  72	| | _Arr
  80	| | _Calls
  88	| | _Ploc
  	| +---
  96	| _Mystrbuf
  104	| _Tiestr
  112	| _Fillch
    	| <alignment member> (size=7)
  	+---
  std::basic_istream<char,struct std::char_traits<char> >::$vbtable@:
   0	| 0
   1	| 24 (?$basic_istream@DU?$char_traits@D@std@@d(?$basic_istream@DU?$char_traits@D@std@@+0)?$basic_ios@DU?$char_traits@D@std@@)
  std::basic_istream<char,struct std::char_traits<char> >::$vftable@:
  	| -24
   0	| &(vtordisp) std::basic_istream<char,struct std::char_traits<char> >::{dtor}
  std::basic_istream<char,struct std::char_traits<char> >::{dtor} this adjustor: 24
  std::basic_istream<char,struct std::char_traits<char> >::__delDtor this adjustor: 24
  std::basic_istream<char,struct std::char_traits<char> >::__vecDelDtor this adjustor: 24
  vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
  std::basic_ios<char,struct std::char_traits<char> >      24       0       4 1
  class std::basic_istream<wchar_t,struct std::char_traits<wchar_t> >	size(120):
  	+---
   0	| {vbptr}
   8	| _Chcount
    	| <alignment member> (size=4)
  	+---
  20	| (vtordisp for vbase std::basic_ios<wchar_t,struct std::char_traits<wchar_t> >)
  	+--- (virtual base std::basic_ios<wchar_t,struct std::char_traits<wchar_t> >)
  24	| +--- (base class std::ios_base)
  24	| | {vfptr}
  32	| | +--- (base class std::_Iosb<int>)
  	| | +---
  32	| | _Stdstr
  40	| | _Mystate
  44	| | _Except
  48	| | _Fmtfl
    	| | <alignment member> (size=4)
  56	| | _Prec
  64	| | _Wide
  72	| | _Arr
  80	| | _Calls
  88	| | _Ploc
  	| +---
  96	| _Mystrbuf
  104	| _Tiestr
  112	| _Fillch
    	| <alignment member> (size=6)
  	+---
  std::basic_istream<wchar_t,struct std::char_traits<wchar_t> >::$vbtable@:
   0	| 0
   1	| 24 (?$basic_istream@_WU?$char_traits@_W@std@@d(?$basic_istream@_WU?$char_traits@_W@std@@+0)?$basic_ios@_WU?$char_traits@_W@std@@)
  std::basic_istream<wchar_t,struct std::char_traits<wchar_t> >::$vftable@:
  	| -24
   0	| &(vtordisp) std::basic_istream<wchar_t,struct std::char_traits<wchar_t> >::{dtor}
  std::basic_istream<wchar_t,struct std::char_traits<wchar_t> >::{dtor} this adjustor: 24
  std::basic_istream<wchar_t,struct std::char_traits<wchar_t> >::__delDtor this adjustor: 24
  std::basic_istream<wchar_t,struct std::char_traits<wchar_t> >::__vecDelDtor this adjustor: 24
  vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
  std::basic_ios<wchar_t,struct std::char_traits<wchar_t> >      24       0       4 1
  class std::basic_iostream<char,struct std::char_traits<char> >	size(128):
  	+---
   0	| +--- (base class std::basic_istream<char,struct std::char_traits<char> >)
   0	| | {vbptr}
   8	| | _Chcount
    	| | <alignment member> (size=4)
  	| +---
  16	| +--- (base class std::basic_ostream<char,struct std::char_traits<char> >)
  16	| | {vbptr}
    	| | <alignment member> (size=4)
  	| +---
    	| <alignment member> (size=4)
  	+---
  28	| (vtordisp for vbase std::basic_ios<char,struct std::char_traits<char> >)
  	+--- (virtual base std::basic_ios<char,struct std::char_traits<char> >)
  32	| +--- (base class std::ios_base)
  32	| | {vfptr}
  40	| | +--- (base class std::_Iosb<int>)
  	| | +---
  40	| | _Stdstr
  48	| | _Mystate
  52	| | _Except
  56	| | _Fmtfl
    	| | <alignment member> (size=4)
  64	| | _Prec
  72	| | _Wide
  80	| | _Arr
  88	| | _Calls
  96	| | _Ploc
  	| +---
  104	| _Mystrbuf
  112	| _Tiestr
  120	| _Fillch
    	| <alignment member> (size=7)
  	+---
  std::basic_iostream<char,struct std::char_traits<char> >::$vbtable@?$basic_istream@DU?$char_traits@D@std@@@:
   0	| 0
   1	| 32 (?$basic_iostream@DU?$char_traits@D@std@@d(?$basic_istream@DU?$char_traits@D@std@@+0)?$basic_ios@DU?$char_traits@D@std@@)
  std::basic_iostream<char,struct std::char_traits<char> >::$vbtable@?$basic_ostream@DU?$char_traits@D@std@@@:
   0	| 0
   1	| 16 (?$basic_iostream@DU?$char_traits@D@std@@d(?$basic_ostream@DU?$char_traits@D@std@@+0)?$basic_ios@DU?$char_traits@D@std@@)
  std::basic_iostream<char,struct std::char_traits<char> >::$vftable@:
  	| -32
   0	| &(vtordisp) std::basic_iostream<char,struct std::char_traits<char> >::{dtor}
  std::basic_iostream<char,struct std::char_traits<char> >::{dtor} this adjustor: 32
  std::basic_iostream<char,struct std::char_traits<char> >::__delDtor this adjustor: 32
  std::basic_iostream<char,struct std::char_traits<char> >::__vecDelDtor this adjustor: 32
  vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
  std::basic_ios<char,struct std::char_traits<char> >      32       0       4 1
  class std::basic_iostream<wchar_t,struct std::char_traits<wchar_t> >	size(128):
  	+---
   0	| +--- (base class std::basic_istream<wchar_t,struct std::char_traits<wchar_t> >)
   0	| | {vbptr}
   8	| | _Chcount
    	| | <alignment member> (size=4)
  	| +---
  16	| +--- (base class std::basic_ostream<wchar_t,struct std::char_traits<wchar_t> >)
  16	| | {vbptr}
    	| | <alignment member> (size=4)
  	| +---
    	| <alignment member> (size=4)
  	+---
  28	| (vtordisp for vbase std::basic_ios<wchar_t,struct std::char_traits<wchar_t> >)
  	+--- (virtual base std::basic_ios<wchar_t,struct std::char_traits<wchar_t> >)
  32	| +--- (base class std::ios_base)
  32	| | {vfptr}
  40	| | +--- (base class std::_Iosb<int>)
  	| | +---
  40	| | _Stdstr
  48	| | _Mystate
  52	| | _Except
  56	| | _Fmtfl
    	| | <alignment member> (size=4)
  64	| | _Prec
  72	| | _Wide
  80	| | _Arr
  88	| | _Calls
  96	| | _Ploc
  	| +---
  104	| _Mystrbuf
  112	| _Tiestr
  120	| _Fillch
    	| <alignment member> (size=6)
  	+---
  std::basic_iostream<wchar_t,struct std::char_traits<wchar_t> >::$vbtable@?$basic_istream@_WU?$char_traits@_W@std@@@:
   0	| 0
   1	| 32 (?$basic_iostream@_WU?$char_traits@_W@std@@d(?$basic_istream@_WU?$char_traits@_W@std@@+0)?$basic_ios@_WU?$char_traits@_W@std@@)
  std::basic_iostream<wchar_t,struct std::char_traits<wchar_t> >::$vbtable@?$basic_ostream@_WU?$char_traits@_W@std@@@:
   0	| 0
   1	| 16 (?$basic_iostream@_WU?$char_traits@_W@std@@d(?$basic_ostream@_WU?$char_traits@_W@std@@+0)?$basic_ios@_WU?$char_traits@_W@std@@)
  std::basic_iostream<wchar_t,struct std::char_traits<wchar_t> >::$vftable@:
  	| -32
   0	| &(vtordisp) std::basic_iostream<wchar_t,struct std::char_traits<wchar_t> >::{dtor}
  std::basic_iostream<wchar_t,struct std::char_traits<wchar_t> >::{dtor} this adjustor: 32
  std::basic_iostream<wchar_t,struct std::char_traits<wchar_t> >::__delDtor this adjustor: 32
  std::basic_iostream<wchar_t,struct std::char_traits<wchar_t> >::__vecDelDtor this adjustor: 32
  vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
  std::basic_ios<wchar_t,struct std::char_traits<wchar_t> >      32       0       4 1
  class Base	size(24):
  	+---
   0	| {vfptr}
   8	| Ba
  12	| Bb
  16	| Bc
    	| <alignment member> (size=4)
  	+---
  Base::$vftable@:
  	| &Base_meta
  	|  0
   0	| &Base::fun1
   1	| &Base::fun2
  Base::fun1 this adjustor: 0
  Base::fun2 this adjustor: 0
  class std::is_error_code_enum<char const *>	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,0>)
  	| +---
  	+---
  class Son1	size(56):
  	+---
   0	| {vfptr}
   8	| {vbptr}
  16	| S1a
  20	| S1b
  24	| S1c
    	| <alignment member> (size=4)
  	+---
  	+--- (virtual base Base)
  32	| {vfptr}
  40	| Ba
  44	| Bb
  48	| Bc
    	| <alignment member> (size=4)
  	+---
  Son1::$vftable@Son1@:
  	| &Son1_meta
  	|  0
   0	| &Son1::fun3
  Son1::$vbtable@:
   0	| -8
   1	| 24 (Son1d(Son1+8)Base)
  Son1::$vftable@Base@:
  	| -32
   0	| &Base::fun1
   1	| &Base::fun2
  Son1::fun3 this adjustor: 0
  vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
              Base      32       8       4 0
  class Son3	size(40):
  	+---
   0	| +--- (base class Base)
   0	| | {vfptr}
   8	| | Ba
  12	| | Bb
  16	| | Bc
    	| | <alignment member> (size=4)
  	| +---
  24	| S1a
  28	| S1b
  32	| S1c
    	| <alignment member> (size=4)
  	+---
  Son3::$vftable@:
  	| &Son3_meta
  	|  0
   0	| &Base::fun1
   1	| &Base::fun2
   2	| &Son3::fun3
  Son3::fun3 this adjustor: 0
  class Son4	size(40):
  	+---
   0	| +--- (base class Base)
   0	| | {vfptr}
   8	| | Ba
  12	| | Bb
  16	| | Bc
    	| | <alignment member> (size=4)
  	| +---
  24	| S2a
  28	| S2b
  32	| S2c
    	| <alignment member> (size=4)
  	+---
  Son4::$vftable@:
  	| &Son4_meta
  	|  0
   0	| &Base::fun1
   1	| &Base::fun2
   2	| &Son4::fun3
  Son4::fun3 this adjustor: 0
  class Son2	size(56):
  	+---
   0	| {vfptr}
   8	| {vbptr}
  16	| S2a
  20	| S2b
  24	| S2c
    	| <alignment member> (size=4)
  	+---
  	+--- (virtual base Base)
  32	| {vfptr}
  40	| Ba
  44	| Bb
  48	| Bc
    	| <alignment member> (size=4)
  	+---
  Son2::$vftable@Son2@:
  	| &Son2_meta
  	|  0
   0	| &Son2::fun4
  Son2::$vbtable@:
   0	| -8
   1	| 24 (Son2d(Son2+8)Base)
  Son2::$vftable@Base@:
  	| -32
   0	| &Base::fun1
   1	| &Base::fun2
  Son2::fun4 this adjustor: 0
  vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
              Base      32       8       4 0
  class Grandson	size(120):
  	+---
   0	| {vfptr}
   8	| {vbptr}
  16	| Ga
  20	| Gb
  24	| Gc
    	| <alignment member> (size=4)
  	+---
  	+--- (virtual base Base)
  32	| {vfptr}
  40	| Ba
  44	| Bb
  48	| Bc
    	| <alignment member> (size=4)
  	+---
  	+--- (virtual base Son1)
  56	| {vfptr}
  64	| {vbptr}
  72	| S1a
  76	| S1b
  80	| S1c
    	| <alignment member> (size=4)
  	+---
  	+--- (virtual base Son2)
  88	| {vfptr}
  96	| {vbptr}
  104	| S2a
  108	| S2b
  112	| S2c
    	| <alignment member> (size=4)
  	+---
  Grandson::$vftable@:
  	| &Grandson_meta
  	|  0
   0	| &Grandson::fun5
  Grandson::$vbtable@Grandson@:
   0	| -8
   1	| 24 (Grandsond(Grandson+8)Base)
   2	| 48 (Grandsond(Grandson+8)Son1)
   3	| 80 (Grandsond(Grandson+8)Son2)
  Grandson::$vftable@Base@:
  	| -32
   0	| &Grandson::fun1
   1	| &Base::fun2
  Grandson::$vftable@Son1@:
  	| -56
   0	| &Son1::fun3
  Grandson::$vbtable@Son1@:
   0	| -8
   1	| -32 (Grandsond(Son1+8)Base)
  Grandson::$vftable@Son2@:
  	| -88
   0	| &Son2::fun4
  Grandson::$vbtable@Son2@:
   0	| -8
   1	| -64 (Grandsond(Son2+8)Base)
  Grandson::fun1 this adjustor: 32
  Grandson::fun5 this adjustor: 0
  vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
              Base      32       8       4 0
              Son1      56       8       8 0
              Son2      88       8      12 0
  class nov	size(104):
  	+---
   0	| +--- (base class Son1)
   0	| | {vfptr}
   8	| | {vbptr}
  16	| | S1a
  20	| | S1b
  24	| | S1c
    	| | <alignment member> (size=4)
  	| +---
  32	| +--- (base class Son2)
  32	| | {vfptr}
  40	| | {vbptr}
  48	| | S2a
  52	| | S2b
  56	| | S2c
    	| | <alignment member> (size=4)
  	| +---
  64	| Na
  68	| Nb
  72	| Nc
    	| <alignment member> (size=4)
  	+---
  	+--- (virtual base Base)
  80	| {vfptr}
  88	| Ba
  92	| Bb
  96	| Bc
    	| <alignment member> (size=4)
  	+---
  nov::$vftable@Son1@:
  	| &nov_meta
  	|  0
   0	| &Son1::fun3
   1	| &nov::fun5
  nov::$vftable@Son2@:
  	| -32
   0	| &Son2::fun4
  nov::$vbtable@Son1@:
   0	| -8
   1	| 72 (novd(Son1+8)Base)
  nov::$vbtable@Son2@:
   0	| -8
   1	| 40 (novd(Son2+8)Base)
  nov::$vftable@Base@:
  	| -80
   0	| &nov::fun1
   1	| &Base::fun2
  nov::fun1 this adjustor: 80
  nov::fun5 this adjustor: 0
  vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
              Base      80       8       4 0
  class nv	size(96):
  	+---
   0	| +--- (base class Son3)
   0	| | +--- (base class Base)
   0	| | | {vfptr}
   8	| | | Ba
  12	| | | Bb
  16	| | | Bc
    	| | | <alignment member> (size=4)
  	| | +---
  24	| | S1a
  28	| | S1b
  32	| | S1c
    	| | <alignment member> (size=4)
  	| +---
  40	| +--- (base class Son4)
  40	| | +--- (base class Base)
  40	| | | {vfptr}
  48	| | | Ba
  52	| | | Bb
  56	| | | Bc
    	| | | <alignment member> (size=4)
  	| | +---
  64	| | S2a
  68	| | S2b
  72	| | S2c
    	| | <alignment member> (size=4)
  	| +---
  80	| Na
  84	| Nb
  88	| Nc
    	| <alignment member> (size=4)
  	+---
  nv::$vftable@Son3@:
  	| &nv_meta
  	|  0
   0	| &nv::fun1
   1	| &Base::fun2
   2	| &Son3::fun3
   3	| &nv::fun5
  nv::$vftable@Son4@:
  	| -40
   0	| &thunk: this-=40; goto nv::fun1
   1	| &Base::fun2
   2	| &Son4::fun3
  nv::fun1 this adjustor: 0
  nv::fun5 this adjustor: 0
  class std::is_error_code_enum<unsigned __int64>	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,0>)
  	| +---
  	+---
  class std::basic_ostream<char,struct std::char_traits<char> >::_Sentry_base	size(8):
  	+---
   0	| _Myostr
  	+---
  class std::basic_ostream<char,struct std::char_traits<char> >::sentry	size(16):
  	+---
   0	| +--- (base class std::basic_ostream<char,struct std::char_traits<char> >::_Sentry_base)
   0	| | _Myostr
  	| +---
   8	| _Ok
    	| <alignment member> (size=7)
  	+---
  class std::ostreambuf_iterator<char,struct std::char_traits<char> >	size(16):
  	+---
   0	| _Failed
    	| <alignment member> (size=7)
   8	| _Strbuf
  	+---
  class std::ostreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> >	size(16):
  	+---
   0	| _Failed
    	| <alignment member> (size=7)
   8	| _Strbuf
  	+---
  class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> >	size(16):
  	+---
   0	| _Strbuf
   8	| _Got
    	| <alignment member> (size=1)
  10	| _Val
    	| <alignment member> (size=4)
  	+---
  class std::istreambuf_iterator<wchar_t,struct std::char_traits<wchar_t> >::_Istreambuf_proxy	size(16):
  	+---
   0	| _Strbuf
   8	| _Keep
    	| <alignment member> (size=6)
  	+---
  class std::istreambuf_iterator<char,struct std::char_traits<char> >	size(16):
  	+---
   0	| _Strbuf
   8	| _Got
   9	| _Val
    	| <alignment member> (size=6)
  	+---
  class std::istreambuf_iterator<char,struct std::char_traits<char> >::_Istreambuf_proxy	size(16):
  	+---
   0	| _Strbuf
   8	| _Keep
    	| <alignment member> (size=7)
  	+---
  class std::fpos<struct _Mbstatet>	size(24):
  	+---
   0	| _Myoff
   8	| _Fpos
  16	| _Mbstatet _Mystate
  	+---
  class std::allocator<struct std::_Container_proxy>	size(1):
  	+---
  	+---
  class std::is_nothrow_constructible<class std::_String_val<struct std::_Simple_types<char32_t> > >	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,1>)
  	| +---
  	+---
  class std::is_nothrow_constructible<class std::_String_val<struct std::_Simple_types<char16_t> > >	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,1>)
  	| +---
  	+---
  class std::is_nothrow_constructible<class std::_String_val<struct std::_Simple_types<wchar_t> > >	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,1>)
  	| +---
  	+---
  class std::is_nothrow_constructible<class std::allocator<char>,class std::allocator<char> >	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,1>)
  	| +---
  	+---
  class std::is_nothrow_constructible<class std::_String_val<struct std::_Simple_types<char> > >	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,1>)
  	| +---
  	+---
  class std::_String_const_iterator<class std::_String_val<struct std::_Simple_types<wchar_t> > >	size(24):
  	+---
   0	| +--- (base class std::_Iterator_base12)
   0	| | _Myproxy
   8	| | _Mynextiter
  	| +---
  16	| _Ptr
  	+---
  class std::_String_const_iterator<class std::_String_val<struct std::_Simple_types<char> > >	size(24):
  	+---
   0	| +--- (base class std::_Iterator_base12)
   0	| | _Myproxy
   8	| | _Mynextiter
  	| +---
  16	| _Ptr
  	+---
  class std::basic_string<wchar_t,struct std::char_traits<wchar_t>,class std::allocator<wchar_t> >::push_back::__l2::<lambda_1>	size(1):
  	+---
  	+---
  class std::basic_string<char,struct std::char_traits<char>,class std::allocator<char> >::push_back::__l2::<lambda_1>	size(1):
  	+---
  	+---
  class std::basic_string<char,struct std::char_traits<char>,class std::allocator<char> >::append::__l2::<lambda_1>	size(1):
  	+---
  	+---
  class std::basic_string<wchar_t,struct std::char_traits<wchar_t>,class std::allocator<wchar_t> >::insert::__l2::<lambda_1>	size(1):
  	+---
  	+---
  class std::basic_string<char,struct std::char_traits<char>,class std::allocator<char> >::insert::__l2::<lambda_1>	size(1):
  	+---
  	+---
  class std::basic_string<char,struct std::char_traits<char>,class std::allocator<char> >::append::__l2::<lambda_1>	size(1):
  	+---
  	+---
  class std::basic_string<wchar_t,struct std::char_traits<wchar_t>,class std::allocator<wchar_t> >::append::__l2::<lambda_1>	size(1):
  	+---
  	+---
  class std::_Constexpr_immortalize_impl<class std::_Generic_error_category>::<unnamed-tag>	size(16):
  	+---
   0	| _Generic_error_category _Storage
  	+---
  class std::_Constexpr_immortalize_impl<class std::_Generic_error_category>	size(16):
  	+---
   0	| _Generic_error_category _Storage
  	+---
  class std::_Constexpr_immortalize_impl<class std::_Iostream_error_category2>::<unnamed-tag>	size(16):
  	+---
   0	| _Iostream_error_category2 _Storage
  	+---
  class std::_Constexpr_immortalize_impl<class std::_Iostream_error_category2>	size(16):
  	+---
   0	| _Iostream_error_category2 _Storage
  	+---
  class std::_Constexpr_immortalize_impl<class std::_System_error_category>::<unnamed-tag>	size(16):
  	+---
   0	| _System_error_category _Storage
  	+---
  class std::_Constexpr_immortalize_impl<class std::_System_error_category>	size(16):
  	+---
   0	| _System_error_category _Storage
  	+---
  class std::_Facetptr<class std::ctype<char> >	size(1):
  	+---
  	+---
  class std::_Facetptr<class std::num_put<char,class std::ostreambuf_iterator<char,struct std::char_traits<char> > > >	size(1):
  	+---
  	+---
  class std::_Facetptr<class std::numpunct<wchar_t> >	size(1):
  	+---
  	+---
  class std::_Facetptr<class std::numpunct<char> >	size(1):
  	+---
  	+---
  class std::_Container_proxy_ptr12<class std::allocator<struct std::_Container_proxy> >	size(16):
  	+---
   0	| +--- (base class std::_Basic_container_proxy_ptr12)
   0	| | _Ptr
  	| +---
   8	| _Al
  	+---
  class std::_Facetptr<class std::ctype<wchar_t> >	size(1):
  	+---
  	+---
  class std::is_nothrow_assignable<class std::_Facet_base * &,std::nullptr_t>	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,1>)
  	| +---
  	+---
  class std::_Tidy_guard<class std::numpunct<wchar_t> >	size(8):
  	+---
   0	| _Target
  	+---
  class std::_Tidy_guard<class std::numpunct<char> >	size(8):
  	+---
   0	| _Target
  	+---
  class std::is_nothrow_constructible<class std::_Facet_base *,class std::_Facet_base * &>	size(1):
  	+---
   0	| +--- (base class std::integral_constant<bool,1>)
  	| +---
  	+---
  class std::_Default_allocator_traits<class std::allocator<struct std::_Container_proxy> >	size(1):
  	+---
  	+---
  class std::allocator_traits<class std::allocator<struct std::_Container_proxy> >	size(1):
  	+---
   0	| +--- (base class std::_Default_allocator_traits<class std::allocator<struct std::_Container_proxy> >)
  	| +---
  	+---
  class std::_Iterator_traits_pointer_base<wchar_t const ,1>	size(1):
  	+---
  	+---
  class std::iterator_traits<wchar_t const *>	size(1):
  	+---
   0	| +--- (base class std::_Iterator_traits_pointer_base<wchar_t const ,1>)
  	| +---
  	+---
  class std::_Iterator_traits_pointer_base<char const ,1>	size(1):
  	+---
  	+---
  class std::iterator_traits<char const *>	size(1):
  	+---
   0	| +--- (base class std::_Iterator_traits_pointer_base<char const ,1>)
  	| +---
  	+---
  ConsoleApplication1.vcxproj -> E:\BaiduSyncdisk\code\c++\练习\ConsoleApplication1\x64\Debug\ConsoleApplication1.exe
