l2=[]
#  将纵向每个字符当作 y 坐标的刻度
for y in range(15,-15,-1):
    l3 = []
    #  将横向每个字符当作 x 坐标的刻度
    i = ' '
    for x in range(-30,30):
        # 如果 x,y 点在心形内,则将一个字符加入到行,否则加入空字符
        love = '最 爱 小 冠 冠 了 '
        if (((x * 0.05) ** 2 + (y * 0.1) ** 2 - 1) ** 3 - (x * 0.05) ** 2 * (y * 0.1) ** 3 < 0):
            l3.append((love[(x-y)%12]))
        elif (((x * 0.05) ** 2 + (y * 0.1) ** 2 - 1) ** 3 - (x * 0.05) ** 2 * (y * 0.1) ** 3 == 0):
             l3.append(('*'[0]))
        else:
            l3.append(" ")

    l2.append(''.join(l3))
l1 ='\n'.join(l2)
print(l1)

