for i in range(1,6,2):
    print('1-6之间的奇数：'+str(i))

coures=['节','星期一','星期二','星期三','星期四','星期五',
              '1','高等数学','计算机基础计','管理学原理','思想政治','Python编程',
              '2','高等数学','计算机基础计','管理学原理','思想政治','Python编程',
              '3','电子商务','离散数学','计算机基础计','大学英语','离散数学',
              '4','电子商务','离散数学','计算机基础计','大学英语','离散数学',
              '5','Python编程','电子商务','高等数学','专业实践','大学英语',
              '6','Python编程','电子商务','高等数学','专业实践','大学英语']
for i in range(0,42,6):
    for j in range(0,6):
        print(coures[i+j]+"\t",end='')
    print("\n")